nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
// Clean mecanum cascaded position controller for the ESP32 Mecanum base.
//
// Clean control rebuild plan:
//   1) Tune one wheel velocity PI clearly.
//   2) Run all four wheel velocity PI loops together.
//   3) Add mecanum body velocity mixing: forward, strafe, rotate.
//   4) Add encoder odometry.
//   5) Add outer position and heading control as cascaded loops.
//
// Research references used for this rebuild:
//   - https://ietresearch.onlinelibrary.wiley.com/doi/full/10.1049/tje2.70006
//   - https://docs.simplefoc.com/angle_cascade_control
//   - https://forum.arduino.cc/t/pid-control-loops/599383
//   - https://robotics.stackexchange.com/questions/90020/how-to-fuse-encoder-ticks-imu-for-odometry
//   - https://docs.wpilib.org/en/stable/docs/software/kinematics-and-odometry/mecanum-drive-odometry.html
//   - https://docs.ros.org/en/rolling/p/robot_localization/configuring_robot_localization.html
//
// Stage 5 of the clean control rebuild:
//   - body-frame forward / strafe / rotate commands
//   - mecanum inverse kinematics -> four wheel RPM targets
//   - all four wheel velocity loops run at the same time
//   - encoder odometry estimates body-frame forward and strafe displacement
//   - outer body-position P loops generate velocity commands
//   - heading uses position error plus gyro-rate damping for clean settling
//   - per-wheel tuned inner velocity PI loops
//   - wheel target scaling preserves direction while respecting RPM limit
//   - PWM saturation with conditional-integration anti-windup
//
// Pi bridge note:
//   This sketch keeps the exact new_pid controller and web GUI. The UART JSON
//   bridge commands are transported by micro-ROS topics instead of raw UART so
//   micro_ros_agent can own the ESP serial link.
//
// This sketch intentionally has no minPWM, feedforward, derivative term,
// slip detector, full EKF, or field-frame pose correction yet.
// Heading control uses IMU yaw. Encoder yaw is kept only as a diagnostic/fallback
// because mecanum wheel slip makes encoder-derived yaw unreliable during turns.

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Wire.h>
#include <math.h>
#include <string.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <micro_ros_arduino.h>
#include <rcl/rcl.h>
#include <rcl/error_handling.h>
#include <rclc/rclc.h>
#include <rclc/executor.h>
#include <rmw_microros/rmw_microros.h>
#include <std_msgs/msg/string.h>

struct EncoderPins {
  uint8_t a;
  uint8_t b;
  const char* name;
};

struct MotorPins {
  uint8_t in1;
  uint8_t in2;
  const char* name;
  uint8_t encoderIndex;
  uint8_t ch1;
  uint8_t ch2;
};

struct WheelPiState {
  float integralError;
  float errorRpm;
  float pTerm;
  float iTerm;
  float rawOutput;
  float output;
};

struct BodyPiState {
  float integralError;
  float error;
  float pTerm;
  float iTerm;
  float rawOutputRpm;
  float outputRpm;
};

struct TelemetrySnapshot {
  bool enabled;
  bool timedRunActive;
  bool positionModeActive;
  bool positionTargetReached;
  uint32_t positionMoveId;
  float kp[4];
  float ki[4];
  float positionKp;
  float positionKi;
  float yawKp;
  float yawKi;
  float positionMaxRpm;
  float positionToleranceCm;
  float yawToleranceDeg;
  bool imuOk;
  bool headingUsesImu;
  float imuYawDeg;
  float imuYawRawDeg;
  float encoderYawDeg;
  float imuGyroDps;
  float imuGyroDpsFilt;
  float imuBiasDps;
  float imuCalStdDps;
  bool imuCalValid;
  float loopDtMs;
  uint32_t nowMs;
  uint32_t timedRunId;
  uint32_t timedRunDurationMs;
  uint32_t timedRunElapsedMs;
  float commandForwardRpm;
  float commandStrafeRpm;
  float commandRotateRpm;
  float targetScale;
  int8_t strafeSign;
  int8_t rotateSign;
  int8_t odomForwardSign;
  int8_t odomStrafeSign;
  int8_t odomYawSign;
  float odomForwardScale;
  float odomStrafeScale;
  float odomForwardCm;
  float odomStrafeCm;
  float odomYawDeg;
  float targetForwardCm;
  float targetStrafeCm;
  float targetYawDeg;
  float positionErrorForwardCm;
  float positionErrorStrafeCm;
  float positionErrorYawDeg;
  float positionPTerm[3];
  float positionITerm[3];
  float positionOutputRpm[3];
  float odomWheelCm[4];
  float rawTargetRpm[4];
  float targetRpm[4];
  float appliedTargetRpm[4];
  float rawRpm[4];
  float measuredRpm[4];
  float errorRpm[4];
  float pTerm[4];
  float iTerm[4];
  float rawOutput[4];
  float output[4];
  float integralError[4];
  int16_t pwm[4];
  int16_t hardwarePwm[4];
  int8_t encoderSign[4];
  int8_t motorSign[4];
  int32_t rawCounts[4];
  int32_t signedCounts[4];
};

const char* WHEEL_NAMES[4] = {"BR", "FR", "BL", "FL"};

// Logical motor order is fixed here as BR, FR, BL, FL.
// Calibrated mapping from the clean single-wheel tests:
//   BR -> MOTA / ENC1
//   FR -> MOTB / ENC2
//   BL -> MOTD / ENC4
//   FL -> MOTC / ENC3
EncoderPins encoders[4] = {
    {36, 39, "ENC1 BackRight"},
    {35, 34, "ENC2 FrontRight"},
    {33, 32, "ENC3 FrontLeft"},
    {25, 26, "ENC4 BackLeft"},
};

MotorPins motors[4] = {
    {14, 27, "MOTA BackRight", 0, 0, 1},
    {19, 13, "MOTB FrontRight", 1, 2, 3},
    {18, 17, "MOTD BackLeft", 3, 6, 7},
    {4, 16, "MOTC FrontLeft", 2, 4, 5},
};

// Calibrated order BR, FR, BL, FL.
int8_t encoderSign[4] = {-1, 1, -1, 1};
int8_t motorSign[4] = {1, 1, 1, 1};

volatile int32_t encoderCount[4] = {0, 0, 0, 0};
volatile uint8_t encoderPrevState[4] = {0, 0, 0, 0};

int32_t lastEncoderCount[4] = {0, 0, 0, 0};
int32_t lastOdomSignedCount[4] = {0, 0, 0, 0};
float rawRpm[4] = {0, 0, 0, 0};
float measuredRpm[4] = {0, 0, 0, 0};
float targetRpm[4] = {0, 0, 0, 0};
int16_t pwmCmd[4] = {0, 0, 0, 0};
int16_t hardwarePwmCmd[4] = {0, 0, 0, 0};
WheelPiState piState[4] = {};
BodyPiState positionPi[3] = {};

const char* AP_SSID = "ESP32-MECANUM-POS";
const char* AP_PASS = "position123";

const float COUNTS_PER_WHEEL_REV = 4346.8f;
const float WHEEL_DIAMETER_CM = 9.7f;
const float WHEEL_CIRCUMFERENCE_CM = WHEEL_DIAMETER_CM * PI;
const uint32_t CONTROL_INTERVAL_MS = 20;
const float NOMINAL_DT_S = CONTROL_INTERVAL_MS / 1000.0f;
const float RPM_TARGET_LIMIT = 45.0f;
const float RPM_FILTER_ALPHA = 0.20f;
const uint32_t UART_BAUD = 115200;
const size_t UART_LINE_MAX = 180;
const uint32_t PI_TELEMETRY_INTERVAL_MS = 100;
const uint8_t DEFAULT_LIMIT_STATUS_PIN = 23;
const uint32_t TIMED_RUN_MIN_MS = 250;
const uint32_t TIMED_RUN_MAX_MS = 120000;
const float CMD_VEL_LINEAR_MPS_TO_RPM = 60.0f / (WHEEL_CIRCUMFERENCE_CM / 100.0f);
const float CMD_VEL_ANGULAR_RADPS_TO_RPM = 22.0f;
const uint32_t CMD_VEL_TIMEOUT_MS = 300;
const uint32_t MICRO_ROS_SPIN_MS = 5;
const size_t MICRO_ROS_TELEMETRY_BUFFER = 640;
const uint32_t MICRO_ROS_RECONNECT_PERIOD_MS = 1000;
const uint32_t MICRO_ROS_AGENT_PING_TIMEOUT_MS = 100;
const uint8_t MICRO_ROS_AGENT_PING_ATTEMPTS = 1;

const uint16_t PWM_FREQ = 1000;
const uint8_t PWM_RES_BITS = 8;
const int PWM_MAX = 255;

