nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
const uint8_t MPU6050_ADDR = 0x68;
const float MPU6050_GYRO_Z_SCALE = 65.5f;  // LSB/(deg/s) at +-500 dps.
const float MPU6050_GYRO_FILTER_ALPHA = 0.20f;
const float MPU6050_CAL_MAX_STD_DPS = 0.35f;
const float ENCODER_YAW_CM_PER_DEG = 0.30f;
const float YAW_DAMP_RPM_PER_DPS = 0.20f;
const float YAW_CONTROL_DEADBAND_DEG = 2.0f;
const float YAW_SETTLE_RATE_DPS = 3.0f;
const float YAW_NEAR_TARGET_DEG = 15.0f;
const float YAW_NEAR_TARGET_MAX_RPM = 10.0f;
const uint8_t POSITION_SETTLE_TICKS_REQUIRED = 8;

float velocityKp[4] = {15.0f, 15.0f, 15.0f, 15.0f};
float velocityKi[4] = {200.0f, 200.0f, 200.0f, 200.0f};
float commandForwardRpm = 0.0f;
float commandStrafeRpm = 0.0f;
float commandRotateRpm = 0.0f;
float rawTargetRpm[4] = {0, 0, 0, 0};
float targetScale = 1.0f;
int8_t strafeSign = -1;
int8_t rotateSign = 1;
int8_t odomForwardSign = 1;
int8_t odomStrafeSign = -1;
int8_t odomYawSign = 1;
float odomForwardScale = 0.9854f;
float odomStrafeScale = 0.9375f;
float odomForwardCm = 0.0f;
float odomStrafeCm = 0.0f;
float odomYawWheelCm = 0.0f;
float odomWheelCm[4] = {0, 0, 0, 0};
bool positionModeActive = false;
bool positionTargetReached = false;
uint8_t positionSettleTicks = 0;
uint32_t positionMoveId = 0;
float targetForwardCm = 0.0f;
float targetStrafeCm = 0.0f;
float targetYawDeg = 0.0f;
float positionErrorForwardCm = 0.0f;
float positionErrorStrafeCm = 0.0f;
float positionErrorYawDeg = 0.0f;
float positionKp = 100.0f;
float positionKi = 0.0f;
float yawKp = 10.0f;
float yawKi = 0.0f;
float positionMaxRpm = 40.0f;
float positionToleranceCm = 2.0f;
float yawToleranceDeg = 2.0f;
bool imuOk = false;
float imuYawDeg = 0.0f;
float imuYawRawDeg = 0.0f;
float imuGyroDps = 0.0f;
float imuGyroDpsFilt = 0.0f;
float imuBiasDps = 0.0f;
float imuCalStdDps = 0.0f;
bool imuCalValid = false;
bool controllerEnabled = false;
float lastLoopDtMs = CONTROL_INTERVAL_MS;
bool timedRunActive = false;
uint32_t timedRunStartMs = 0;
uint32_t timedRunDurationMs = 3000;
uint32_t timedRunId = 0;

WebServer server(80);
SemaphoreHandle_t stateMutex = nullptr;
SemaphoreHandle_t serialMutex = nullptr;
TaskHandle_t controlTaskHandle = nullptr;
TaskHandle_t webTaskHandle = nullptr;
TaskHandle_t uartTaskHandle = nullptr;
TaskHandle_t piTelemetryTaskHandle = nullptr;
TaskHandle_t microRosTaskHandle = nullptr;

#define STATE_LOCK()   do { if (stateMutex) xSemaphoreTake(stateMutex, portMAX_DELAY); } while (0)
#define STATE_UNLOCK() do { if (stateMutex) xSemaphoreGive(stateMutex); } while (0)
#define SERIAL_LOCK()   do { if (serialMutex) xSemaphoreTake(serialMutex, portMAX_DELAY); } while (0)
#define SERIAL_UNLOCK() do { if (serialMutex) xSemaphoreGive(serialMutex); } while (0)

uint32_t piActiveSeq = 0;
bool piMoveActive = false;
float piMoveStartForwardCm = 0.0f;
float piMoveStartStrafeCm = 0.0f;
float piOdomForwardCm = 0.0f;
float piOdomStrafeCm = 0.0f;
float piLastMoveAngleDeg = 0.0f;
float piLastMoveDistanceCm = 0.0f;
bool piPendingDone = false;
uint32_t piPendingDoneSeq = 0;
uint8_t piPendingDoneCode = 0;

rcl_allocator_t microrosAllocator;
rclc_support_t microrosSupport;
rcl_node_t microrosNode = rcl_get_zero_initialized_node();
rclc_executor_t microrosExecutor = rclc_executor_get_zero_initialized_executor();
rcl_timer_t telemetryTimer = rcl_get_zero_initialized_timer();
rcl_subscription_t moveGoalSub = rcl_get_zero_initialized_subscription();
rcl_publisher_t telemetryJsonPub = rcl_get_zero_initialized_publisher();
std_msgs__msg__String moveGoalMsg;
std_msgs__msg__String telemetryJsonMsg;
char moveGoalBuffer[UART_LINE_MAX];
char telemetryJsonBuffer[MICRO_ROS_TELEMETRY_BUFFER];
bool microrosEntitiesCreated = false;
uint32_t microrosLastConnectAttemptMs = 0;

#define RCSOFTCHECK(fn) do { rcl_ret_t temp_rc = (fn); (void)temp_rc; } while (0)

float wrapAngleDeg(float angle) {
  while (angle > 180.0f) angle -= 360.0f;
  while (angle <= -180.0f) angle += 360.0f;
  return angle;
}

float shortestAngleErrorDeg(float target, float measurement) {
  return wrapAngleDeg(target - measurement);
}

#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
void pwmAttachPinCompat(uint8_t pin, uint8_t channelHint) {
  (void)channelHint;
  ledcAttach(pin, PWM_FREQ, PWM_RES_BITS);
}

void pwmWriteCompat(uint8_t pin, uint8_t channelHint, uint32_t duty) {
  (void)channelHint;
  ledcWrite(pin, duty);
}
#else
void pwmAttachPinCompat(uint8_t pin, uint8_t channel) {
  ledcSetup(channel, PWM_FREQ, PWM_RES_BITS);
  ledcAttachPin(pin, channel);
}

void pwmWriteCompat(uint8_t pin, uint8_t channel, uint32_t duty) {
  (void)pin;
  ledcWrite(channel, duty);
}
#endif

bool isInputOnlyPin(uint8_t pin) {
  return pin == 34 || pin == 35 || pin == 36 || pin == 39;
}

void setupEncoderPin(uint8_t pin) {
  pinMode(pin, isInputOnlyPin(pin) ? INPUT : INPUT_PULLUP);
}

void IRAM_ATTR updateEncoder(uint8_t idx) {
  uint8_t state = (digitalRead(encoders[idx].a) << 1) | digitalRead(encoders[idx].b);
  uint8_t prev = encoderPrevState[idx];
  uint8_t transition = (prev << 2) | state;

  switch (transition) {
    case 0b0001:
    case 0b0111:
    case 0b1110:
    case 0b1000:
      encoderCount[idx]++;
      break;
    case 0b0010:
    case 0b0100:
    case 0b1101:
    case 0b1011:
      encoderCount[idx]--;
      break;
    default:
      break;
  }

  encoderPrevState[idx] = state;
}

void IRAM_ATTR isrEnc0A() { updateEncoder(0); }
void IRAM_ATTR isrEnc0B() { updateEncoder(0); }
void IRAM_ATTR isrEnc1A() { updateEncoder(1); }
void IRAM_ATTR isrEnc1B() { updateEncoder(1); }
void IRAM_ATTR isrEnc2A() { updateEncoder(2); }
void IRAM_ATTR isrEnc2B() { updateEncoder(2); }
void IRAM_ATTR isrEnc3A() { updateEncoder(3); }
void IRAM_ATTR isrEnc3B() { updateEncoder(3); }

int32_t readEncoderCount(uint8_t idx) {
  noInterrupts();
  int32_t count = encoderCount[idx];
  interrupts();
  return count;
}

void setMotorPwmSigned(uint8_t wheel, int command) {
  command = constrain(command, -PWM_MAX, PWM_MAX);
  pwmCmd[wheel] = (int16_t)command;

  int hardwareCommand = constrain(command * (int)motorSign[wheel], -PWM_MAX, PWM_MAX);
  hardwarePwmCmd[wheel] = (int16_t)hardwareCommand;

  const MotorPins& motor = motors[wheel];
  if (hardwareCommand > 0) {
    pwmWriteCompat(motor.in1, motor.ch1, (uint32_t)hardwareCommand);
    pwmWriteCompat(motor.in2, motor.ch2, 0);
  } else if (hardwareCommand < 0) {
    pwmWriteCompat(motor.in1, motor.ch1, 0);
    pwmWriteCompat(motor.in2, motor.ch2, (uint32_t)(-hardwareCommand));
  } else {
    pwmWriteCompat(motor.in1, motor.ch1, 0);
    pwmWriteCompat(motor.in2, motor.ch2, 0);
  }
}

void stopAllMotors() {
  for (uint8_t i = 0; i < 4; i++) {
    setMotorPwmSigned(i, 0);
  }
}

void resetPiState(uint8_t wheel) {
  piState[wheel].integralError = 0.0f;
  piState[wheel].errorRpm = 0.0f;
  piState[wheel].pTerm = 0.0f;
  piState[wheel].iTerm = 0.0f;
  piState[wheel].rawOutput = 0.0f;
  piState[wheel].output = 0.0f;
}

void resetAllPiStates() {
  for (uint8_t i = 0; i < 4; i++) {
    resetPiState(i);
  }
}

