nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
void resetBodyPiState(uint8_t axis) {
  positionPi[axis].integralError = 0.0f;
  positionPi[axis].error = 0.0f;
  positionPi[axis].pTerm = 0.0f;
  positionPi[axis].iTerm = 0.0f;
  positionPi[axis].rawOutputRpm = 0.0f;
  positionPi[axis].outputRpm = 0.0f;
}

void resetAllBodyPiStates() {
  for (uint8_t axis = 0; axis < 3; axis++) {
    resetBodyPiState(axis);
  }
  positionSettleTicks = 0;
}

void resetEncoderMeasurements() {
  noInterrupts();
  for (uint8_t i = 0; i < 4; i++) {
    encoderCount[i] = 0;
  }
  interrupts();

  for (uint8_t i = 0; i < 4; i++) {
    lastEncoderCount[i] = 0;
    rawRpm[i] = 0.0f;
    measuredRpm[i] = 0.0f;
  }
}

void resetRpmMeasurementsToCurrentCounts() {
  for (uint8_t encoder = 0; encoder < 4; encoder++) {
    lastEncoderCount[encoder] = readEncoderCount(encoder);
  }

  for (uint8_t wheel = 0; wheel < 4; wheel++) {
    rawRpm[wheel] = 0.0f;
    measuredRpm[wheel] = 0.0f;
  }
}

void resetOdometryToCurrentCounts() {
  for (uint8_t wheel = 0; wheel < 4; wheel++) {
    int32_t rawCount = readEncoderCount(motors[wheel].encoderIndex);
    lastOdomSignedCount[wheel] = ((int32_t)encoderSign[wheel]) * rawCount;
    odomWheelCm[wheel] = 0.0f;
  }

  odomForwardCm = 0.0f;
  odomStrafeCm = 0.0f;
  odomYawWheelCm = 0.0f;
}

void updateMeasuredRpm(float dt) {
  if (dt <= 0.0001f) {
    return;
  }

  const float rpmScale = (60.0f / COUNTS_PER_WHEEL_REV) / dt;
  for (uint8_t wheel = 0; wheel < 4; wheel++) {
    uint8_t encoderIndex = motors[wheel].encoderIndex;
    int32_t countNow = readEncoderCount(encoderIndex);
    int32_t delta = countNow - lastEncoderCount[encoderIndex];
    lastEncoderCount[encoderIndex] = countNow;

    rawRpm[wheel] = ((float)encoderSign[wheel]) * ((float)delta) * rpmScale;
    measuredRpm[wheel] += RPM_FILTER_ALPHA * (rawRpm[wheel] - measuredRpm[wheel]);
  }
}

void updateOdometry() {
  float deltaWheelCm[4] = {0, 0, 0, 0};

  for (uint8_t wheel = 0; wheel < 4; wheel++) {
    int32_t rawCount = readEncoderCount(motors[wheel].encoderIndex);
    int32_t signedCount = ((int32_t)encoderSign[wheel]) * rawCount;
    int32_t deltaCount = signedCount - lastOdomSignedCount[wheel];
    lastOdomSignedCount[wheel] = signedCount;

    deltaWheelCm[wheel] = ((float)deltaCount / COUNTS_PER_WHEEL_REV) * WHEEL_CIRCUMFERENCE_CM;
    odomWheelCm[wheel] += deltaWheelCm[wheel];
  }

  // Logical order is BR, FR, BL, FL. This is body-frame dead reckoning.
  odomForwardCm += (deltaWheelCm[0] + deltaWheelCm[1] + deltaWheelCm[2] + deltaWheelCm[3]) * 0.25f;
  odomStrafeCm += (-deltaWheelCm[0] + deltaWheelCm[1] + deltaWheelCm[2] - deltaWheelCm[3]) * 0.25f;
  odomYawWheelCm += (-deltaWheelCm[0] - deltaWheelCm[1] + deltaWheelCm[2] + deltaWheelCm[3]) * 0.25f;
}

bool imuWriteReg(uint8_t reg, uint8_t value) {
  Wire.beginTransmission(MPU6050_ADDR);
  Wire.write(reg);
  Wire.write(value);
  return Wire.endTransmission() == 0;
}

bool imuReadRegs(uint8_t startReg, uint8_t* buf, uint8_t len) {
  Wire.beginTransmission(MPU6050_ADDR);
  Wire.write(startReg);
  if (Wire.endTransmission(false) != 0) {
    return false;
  }

  uint8_t read = Wire.requestFrom((int)MPU6050_ADDR, (int)len, (int)true);
  if (read != len) {
    return false;
  }

  for (uint8_t i = 0; i < len; i++) {
    buf[i] = Wire.read();
  }
  return true;
}

bool imuReadGyroZRaw(int16_t& gzRaw) {
  uint8_t data[2] = {0, 0};
  if (!imuReadRegs(0x47, data, 2)) {
    return false;
  }
  gzRaw = (int16_t)((data[0] << 8) | data[1]);
  return true;
}

bool imuCalibrateBias(uint16_t samples) {
  if (!imuOk || samples < 20) {
    return false;
  }

  float sum = 0.0f;
  float sumSq = 0.0f;
  uint16_t okCount = 0;
  for (uint16_t i = 0; i < samples; i++) {
    int16_t gzRaw = 0;
    if (imuReadGyroZRaw(gzRaw)) {
      float dps = ((float)gzRaw) / MPU6050_GYRO_Z_SCALE;
      sum += dps;
      sumSq += dps * dps;
      okCount++;
    }
    delay(2);
  }

  if (okCount < samples / 2) {
    imuCalValid = false;
    return false;
  }

  float mean = sum / (float)okCount;
  float variance = (sumSq / (float)okCount) - (mean * mean);
  imuCalStdDps = sqrtf(max(0.0f, variance));
  if (imuCalStdDps > MPU6050_CAL_MAX_STD_DPS) {
    imuCalValid = false;
    return false;
  }

  imuBiasDps = mean;
  imuGyroDps = 0.0f;
  imuGyroDpsFilt = 0.0f;
  imuCalValid = true;
  return true;
}

bool imuInit() {
  Wire.begin();
  delay(10);

  bool ok = true;
  ok &= imuWriteReg(0x6B, 0x00);  // Wake up MPU6050.
  ok &= imuWriteReg(0x1B, 0x08);  // Gyro FS_SEL=1 => +-500 dps.
  ok &= imuWriteReg(0x1A, 0x03);  // DLPF for less noise.
  delay(50);

  imuOk = ok;
  imuBiasDps = 0.0f;
  imuYawDeg = 0.0f;
  imuYawRawDeg = 0.0f;
  imuGyroDps = 0.0f;
  imuGyroDpsFilt = 0.0f;
  imuCalStdDps = 0.0f;
  imuCalValid = false;

  if (imuOk) {
    imuCalibrateBias(400);
  }
  return imuOk;
}

void imuUpdate(float dt) {
  if (!imuOk || dt <= 0.0001f) {
    imuGyroDps = 0.0f;
    imuGyroDpsFilt = 0.0f;
    return;
  }

  int16_t gzRaw = 0;
  if (!imuReadGyroZRaw(gzRaw)) {
    imuGyroDps = 0.0f;
    return;
  }

  imuGyroDps = ((float)gzRaw) / MPU6050_GYRO_Z_SCALE - imuBiasDps;
  imuGyroDpsFilt += MPU6050_GYRO_FILTER_ALPHA * (imuGyroDps - imuGyroDpsFilt);
  imuYawRawDeg = wrapAngleDeg(imuYawRawDeg + imuGyroDps * dt);
  imuYawDeg = wrapAngleDeg(imuYawDeg + imuGyroDpsFilt * dt);
}

void updateMecanumTargets() {
  float vx = constrain(commandForwardRpm, -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  float vy = constrain(commandStrafeRpm, -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT) * (float)strafeSign;
  float omega = constrain(commandRotateRpm, -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT) * (float)rotateSign;

  // Confirmed logical order [BR, FR, BL, FL].
  rawTargetRpm[0] = vx - vy + omega;
  rawTargetRpm[1] = vx + vy + omega;
  rawTargetRpm[2] = vx + vy - omega;
  rawTargetRpm[3] = vx - vy - omega;

  float maxAbsTarget = 0.0f;
  for (uint8_t i = 0; i < 4; i++) {
    maxAbsTarget = max(maxAbsTarget, fabsf(rawTargetRpm[i]));
  }

  targetScale = 1.0f;
  if (maxAbsTarget > RPM_TARGET_LIMIT && maxAbsTarget > 0.0001f) {
    targetScale = RPM_TARGET_LIMIT / maxAbsTarget;
  }

