nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
  for (uint8_t i = 0; i < 4; i++) {
    targetRpm[i] = constrain(rawTargetRpm[i] * targetScale, -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  }
}

float displayedOdomForwardCm() {
  return ((float)odomForwardSign) * odomForwardCm * odomForwardScale;
}

float displayedOdomStrafeCm() {
  return ((float)odomStrafeSign) * odomStrafeCm * odomStrafeScale;
}

float displayedOdomYawWheelCm() {
  return ((float)odomYawSign) * odomYawWheelCm;
}

float encoderYawDeg() {
  if (ENCODER_YAW_CM_PER_DEG <= 0.0001f) {
    return 0.0f;
  }
  return displayedOdomYawWheelCm() / ENCODER_YAW_CM_PER_DEG;
}

float displayedImuYawDeg() {
  return wrapAngleDeg(((float)odomYawSign) * imuYawDeg);
}

float displayedImuYawRawDeg() {
  return wrapAngleDeg(((float)odomYawSign) * imuYawRawDeg);
}

float displayedImuGyroDps() {
  return ((float)odomYawSign) * imuGyroDps;
}

float displayedImuGyroDpsFilt() {
  return ((float)odomYawSign) * imuGyroDpsFilt;
}

bool imuHeadingReady() {
  return imuOk && imuCalValid;
}

float displayedOdomYawDeg() {
  return imuHeadingReady() ? displayedImuYawDeg() : encoderYawDeg();
}

float runBodyPositionPi(uint8_t axis, float error, float kp, float ki, float dt, float outputLimitRpm, float tolerance) {
  BodyPiState& state = positionPi[axis];
  state.error = error;

  if (fabsf(error) <= tolerance) {
    resetBodyPiState(axis);
    return 0.0f;
  }

  state.pTerm = kp * error;

  float candidateIntegral = state.integralError;
  if (ki > 0.0001f && dt > 0.0001f) {
    candidateIntegral += error * dt;
  }

  float candidateITerm = ki * candidateIntegral;
  float candidateRawOutput = state.pTerm + candidateITerm;
  bool pushesHighSaturation = candidateRawOutput > outputLimitRpm && error > 0.0f;
  bool pushesLowSaturation = candidateRawOutput < -outputLimitRpm && error < 0.0f;
  if (!pushesHighSaturation && !pushesLowSaturation) {
    state.integralError = candidateIntegral;
  }

  state.iTerm = ki * state.integralError;
  state.rawOutputRpm = state.pTerm + state.iTerm;
  state.outputRpm = constrain(state.rawOutputRpm, -outputLimitRpm, outputLimitRpm);
  return state.outputRpm;
}

float runYawPositionController(float error, float outputLimitRpm) {
  BodyPiState& state = positionPi[2];
  state.error = error;

  const float yawRateDps = imuHeadingReady() ? displayedImuGyroDpsFilt() : 0.0f;
  const float absError = fabsf(error);
  const float absRate = fabsf(yawRateDps);

  float activeError = error;
  if (absError <= YAW_CONTROL_DEADBAND_DEG) {
    activeError = 0.0f;
  }

  state.pTerm = yawKp * activeError;
  state.iTerm = 0.0f;

  float dampingRpm = imuHeadingReady() ? (-YAW_DAMP_RPM_PER_DPS * yawRateDps) : 0.0f;
  if (absError <= yawToleranceDeg && absRate <= YAW_SETTLE_RATE_DPS) {
    resetBodyPiState(2);
    return 0.0f;
  }

  state.rawOutputRpm = state.pTerm + dampingRpm;

  float limit = outputLimitRpm;
  if (absError <= YAW_NEAR_TARGET_DEG) {
    limit = min(limit, YAW_NEAR_TARGET_MAX_RPM);
  }

  state.outputRpm = constrain(state.rawOutputRpm, -limit, limit);
  return state.outputRpm;
}

void updatePositionController(float dt) {
  if (!positionModeActive) {
    return;
  }

  positionErrorForwardCm = targetForwardCm - displayedOdomForwardCm();
  positionErrorStrafeCm = targetStrafeCm - displayedOdomStrafeCm();
  positionErrorYawDeg = shortestAngleErrorDeg(targetYawDeg, displayedOdomYawDeg());

  bool pureYawMove = fabsf(targetForwardCm) <= positionToleranceCm &&
                     fabsf(targetStrafeCm) <= positionToleranceCm;
  bool forwardDone = pureYawMove || fabsf(positionErrorForwardCm) <= positionToleranceCm;
  bool strafeDone = pureYawMove || fabsf(positionErrorStrafeCm) <= positionToleranceCm;
  bool yawErrorDone = fabsf(positionErrorYawDeg) <= yawToleranceDeg;
  bool yawRateDone = !imuHeadingReady() || fabsf(displayedImuGyroDpsFilt()) <= YAW_SETTLE_RATE_DPS;
  bool allAxesSettled = forwardDone && strafeDone && yawErrorDone && yawRateDone;
  if (allAxesSettled) {
    if (positionSettleTicks < POSITION_SETTLE_TICKS_REQUIRED) {
      positionSettleTicks++;
    }
  } else {
    positionSettleTicks = 0;
  }
  positionTargetReached = positionSettleTicks >= POSITION_SETTLE_TICKS_REQUIRED;

  if (positionTargetReached) {
    commandForwardRpm = 0.0f;
    commandStrafeRpm = 0.0f;
    commandRotateRpm = 0.0f;
    updateMecanumTargets();
    positionModeActive = false;
    controllerEnabled = false;
    resetAllPiStates();
    resetAllBodyPiStates();
    stopAllMotors();
    return;
  }

  if (pureYawMove) {
    commandForwardRpm = 0.0f;
    commandStrafeRpm = 0.0f;
    resetBodyPiState(0);
    resetBodyPiState(1);
  } else {
    commandForwardRpm = runBodyPositionPi(0, positionErrorForwardCm, positionKp, positionKi, dt, positionMaxRpm, positionToleranceCm);
    commandStrafeRpm = runBodyPositionPi(1, positionErrorStrafeCm, positionKp, positionKi, dt, positionMaxRpm, positionToleranceCm);
  }

  float yawControlRpm = runYawPositionController(positionErrorYawDeg, positionMaxRpm);
  // The heading loop works in the displayed/right-hand-rule yaw convention:
  // left/CCW is positive, right/CW is negative. Keep commandRotateRpm in that
  // logical convention and let updateMecanumTargets() apply the calibrated
  // hardware rotateSign exactly once at the wheel-mixing boundary.
  commandRotateRpm = yawControlRpm;
  updateMecanumTargets();
}

float wheelTargetRpm(uint8_t wheel) {
  if (!controllerEnabled) {
    return 0.0f;
  }
  return targetRpm[wheel];
}

void runVelocityPi(uint8_t wheel, float target, float dt) {
  if (fabsf(target) < 0.01f) {
    resetPiState(wheel);
    setMotorPwmSigned(wheel, 0);
    return;
  }

  WheelPiState& state = piState[wheel];
  state.errorRpm = target - measuredRpm[wheel];
  state.pTerm = velocityKp[wheel] * state.errorRpm;

  float candidateIntegral = state.integralError;
  if (velocityKi[wheel] > 0.0001f) {
    candidateIntegral += state.errorRpm * dt;
  }
  float candidateITerm = velocityKi[wheel] * candidateIntegral;
  float candidateRawOutput = state.pTerm + candidateITerm;

