nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
  bool pushesHighSaturation = candidateRawOutput > PWM_MAX && state.errorRpm > 0.0f;
  bool pushesLowSaturation = candidateRawOutput < -PWM_MAX && state.errorRpm < 0.0f;
  if (!pushesHighSaturation && !pushesLowSaturation) {
    state.integralError = candidateIntegral;
  }

  state.iTerm = velocityKi[wheel] * state.integralError;
  state.rawOutput = state.pTerm + state.iTerm;
  state.output = constrain(state.rawOutput, -((float)PWM_MAX), (float)PWM_MAX);

  setMotorPwmSigned(wheel, (int)lroundf(state.output));
}

void runControlTick(float dt) {
  if (timedRunActive && ((uint32_t)(millis() - timedRunStartMs) >= timedRunDurationMs)) {
    timedRunActive = false;
    positionModeActive = false;
    controllerEnabled = false;
    resetAllPiStates();
    resetAllBodyPiStates();
    stopAllMotors();
  }

  updateMeasuredRpm(dt);
  updateOdometry();
  imuUpdate(dt);
  updatePositionController(dt);
  lastLoopDtMs = dt * 1000.0f;

  for (uint8_t wheel = 0; wheel < 4; wheel++) {
    runVelocityPi(wheel, wheelTargetRpm(wheel), dt);
  }
}

void captureTelemetry(TelemetrySnapshot& snap) {
  STATE_LOCK();
  snap.enabled = controllerEnabled;
  snap.timedRunActive = timedRunActive;
  snap.positionModeActive = positionModeActive;
  snap.positionTargetReached = positionTargetReached;
  snap.positionMoveId = positionMoveId;
  snap.positionKp = positionKp;
  snap.positionKi = positionKi;
  snap.yawKp = yawKp;
  snap.yawKi = yawKi;
  snap.positionMaxRpm = positionMaxRpm;
  snap.positionToleranceCm = positionToleranceCm;
  snap.yawToleranceDeg = yawToleranceDeg;
  snap.imuOk = imuOk;
  snap.headingUsesImu = imuHeadingReady();
  snap.imuYawDeg = displayedImuYawDeg();
  snap.imuYawRawDeg = displayedImuYawRawDeg();
  snap.encoderYawDeg = encoderYawDeg();
  snap.imuGyroDps = displayedImuGyroDps();
  snap.imuGyroDpsFilt = displayedImuGyroDpsFilt();
  snap.imuBiasDps = imuBiasDps;
  snap.imuCalStdDps = imuCalStdDps;
  snap.imuCalValid = imuCalValid;
  snap.loopDtMs = lastLoopDtMs;
  snap.nowMs = millis();
  snap.timedRunId = timedRunId;
  snap.timedRunDurationMs = timedRunDurationMs;
  if (timedRunStartMs == 0) {
    snap.timedRunElapsedMs = 0;
  } else {
    snap.timedRunElapsedMs = min((uint32_t)(snap.nowMs - timedRunStartMs), timedRunDurationMs);
  }
  snap.commandForwardRpm = commandForwardRpm;
  snap.commandStrafeRpm = commandStrafeRpm;
  snap.commandRotateRpm = commandRotateRpm;
  snap.targetScale = targetScale;
  snap.strafeSign = strafeSign;
  snap.rotateSign = rotateSign;
  snap.odomForwardSign = odomForwardSign;
  snap.odomStrafeSign = odomStrafeSign;
  snap.odomYawSign = odomYawSign;
  snap.odomForwardScale = odomForwardScale;
  snap.odomStrafeScale = odomStrafeScale;
  snap.odomForwardCm = displayedOdomForwardCm();
  snap.odomStrafeCm = displayedOdomStrafeCm();
  snap.odomYawDeg = displayedOdomYawDeg();
  snap.targetForwardCm = targetForwardCm;
  snap.targetStrafeCm = targetStrafeCm;
  snap.targetYawDeg = targetYawDeg;
  snap.positionErrorForwardCm = positionErrorForwardCm;
  snap.positionErrorStrafeCm = positionErrorStrafeCm;
  snap.positionErrorYawDeg = positionErrorYawDeg;
  for (uint8_t axis = 0; axis < 3; axis++) {
    snap.positionPTerm[axis] = positionPi[axis].pTerm;
    snap.positionITerm[axis] = positionPi[axis].iTerm;
    snap.positionOutputRpm[axis] = positionPi[axis].outputRpm;
  }

  for (uint8_t i = 0; i < 4; i++) {
    snap.kp[i] = velocityKp[i];
    snap.ki[i] = velocityKi[i];
    snap.odomWheelCm[i] = odomWheelCm[i];
    snap.rawTargetRpm[i] = rawTargetRpm[i];
    snap.targetRpm[i] = targetRpm[i];
    snap.appliedTargetRpm[i] = wheelTargetRpm(i);
    snap.rawRpm[i] = rawRpm[i];
    snap.measuredRpm[i] = measuredRpm[i];
    snap.errorRpm[i] = piState[i].errorRpm;
    snap.pTerm[i] = piState[i].pTerm;
    snap.iTerm[i] = piState[i].iTerm;
    snap.rawOutput[i] = piState[i].rawOutput;
    snap.output[i] = piState[i].output;
    snap.integralError[i] = piState[i].integralError;
    snap.pwm[i] = pwmCmd[i];
    snap.hardwarePwm[i] = hardwarePwmCmd[i];
    snap.encoderSign[i] = encoderSign[i];
    snap.motorSign[i] = motorSign[i];
  }
  STATE_UNLOCK();

  for (uint8_t wheel = 0; wheel < 4; wheel++) {
    int32_t rawCount = readEncoderCount(motors[wheel].encoderIndex);
    snap.rawCounts[wheel] = rawCount;
    snap.signedCounts[wheel] = ((int32_t)snap.encoderSign[wheel]) * rawCount;
  }
}

void appendFloatArray(String& body, const float values[4], uint8_t digits) {
  body += "[";
  for (uint8_t i = 0; i < 4; i++) {
    body += String(values[i], (unsigned int)digits);
    if (i < 3) body += ",";
  }
  body += "]";
}

void appendFloatArray3(String& body, const float values[3], uint8_t digits) {
  body += "[";
  for (uint8_t i = 0; i < 3; i++) {
    body += String(values[i], (unsigned int)digits);
    if (i < 2) body += ",";
  }
  body += "]";
}

void appendInt16Array(String& body, const int16_t values[4]) {
  body += "[";
  for (uint8_t i = 0; i < 4; i++) {
    body += String(values[i]);
    if (i < 3) body += ",";
  }
  body += "]";
}

void appendInt32Array(String& body, const int32_t values[4]) {
  body += "[";
  for (uint8_t i = 0; i < 4; i++) {
    body += String(values[i]);
    if (i < 3) body += ",";
  }
  body += "]";
}

void appendInt8Array(String& body, const int8_t values[4]) {
  body += "[";
  for (uint8_t i = 0; i < 4; i++) {
    body += String(values[i]);
    if (i < 3) body += ",";
  }
  body += "]";
}

String telemetryJson() {
  TelemetrySnapshot snap = {};
  captureTelemetry(snap);

  String body;
  body.reserve(3600);
  body += "{";
  body += "\"enabled\":" + String(snap.enabled ? "true" : "false") + ",";
  body += "\"positionModeActive\":" + String(snap.positionModeActive ? "true" : "false") + ",";
  body += "\"positionTargetReached\":" + String(snap.positionTargetReached ? "true" : "false") + ",";
  body += "\"positionMoveId\":" + String(snap.positionMoveId) + ",";
  body += "\"nowMs\":" + String(snap.nowMs) + ",";
  body += "\"kp\":";
  appendFloatArray(body, snap.kp, 4);
  body += ",\"ki\":";
  appendFloatArray(body, snap.ki, 4);
  body += ",";
  body += "\"loopDtMs\":" + String(snap.loopDtMs, 3) + ",";
  body += "\"timed\":{";
  body += "\"active\":" + String(snap.timedRunActive ? "true" : "false") + ",";
  body += "\"id\":" + String(snap.timedRunId) + ",";
  body += "\"durationMs\":" + String(snap.timedRunDurationMs) + ",";
  body += "\"elapsedMs\":" + String(snap.timedRunElapsedMs);
  body += "},";
  body += "\"countsPerRev\":" + String(COUNTS_PER_WHEEL_REV, 1) + ",";
  body += "\"rpmLimit\":" + String(RPM_TARGET_LIMIT, 1) + ",";
  body += "\"rpmFilterAlpha\":" + String(RPM_FILTER_ALPHA, 3) + ",";
  body += "\"command\":{";
  body += "\"forwardRpm\":" + String(snap.commandForwardRpm, 3) + ",";
  body += "\"strafeRpm\":" + String(snap.commandStrafeRpm, 3) + ",";
  body += "\"rotateRpm\":" + String(snap.commandRotateRpm, 3) + ",";
  body += "\"targetScale\":" + String(snap.targetScale, 4) + ",";
  body += "\"strafeSign\":" + String(snap.strafeSign) + ",";
  body += "\"rotateSign\":" + String(snap.rotateSign) + ",";
  body += "\"odomForwardSign\":" + String(snap.odomForwardSign) + ",";
  body += "\"odomStrafeSign\":" + String(snap.odomStrafeSign) + ",";
  body += "\"odomYawSign\":" + String(snap.odomYawSign) + ",";
  body += "\"odomForwardScale\":" + String(snap.odomForwardScale, 5) + ",";
  body += "\"odomStrafeScale\":" + String(snap.odomStrafeScale, 5);
  body += "},";
  body += "\"odometry\":{";
  body += "\"forwardCm\":" + String(snap.odomForwardCm, 3) + ",";
  body += "\"strafeCm\":" + String(snap.odomStrafeCm, 3) + ",";
  body += "\"yawDeg\":" + String(snap.odomYawDeg, 3) + ",";
  body += "\"yawWheelCm\":" + String(displayedOdomYawWheelCm(), 3) + ",";
  body += "\"wheelCm\":";
  appendFloatArray(body, snap.odomWheelCm, 3);
  body += "},";
  body += "\"wheelDiameterCm\":" + String(WHEEL_DIAMETER_CM, 3) + ",";
  body += "\"imu\":{";
  body += "\"ok\":" + String(snap.imuOk ? "true" : "false") + ",";
  body += "\"headingUsesImu\":" + String(snap.headingUsesImu ? "true" : "false") + ",";
  body += "\"yawDeg\":" + String(snap.imuYawDeg, 3) + ",";
  body += "\"yawRawDeg\":" + String(snap.imuYawRawDeg, 3) + ",";
  body += "\"encoderYawDeg\":" + String(snap.encoderYawDeg, 3) + ",";
  body += "\"gyroDps\":" + String(snap.imuGyroDps, 3) + ",";
  body += "\"gyroFiltDps\":" + String(snap.imuGyroDpsFilt, 3) + ",";
  body += "\"biasDps\":" + String(snap.imuBiasDps, 4) + ",";
  body += "\"calStdDps\":" + String(snap.imuCalStdDps, 4) + ",";
  body += "\"calValid\":" + String(snap.imuCalValid ? "true" : "false");
  body += "},";
  body += "\"position\":{";
  body += "\"targetForwardCm\":" + String(snap.targetForwardCm, 3) + ",";
  body += "\"targetStrafeCm\":" + String(snap.targetStrafeCm, 3) + ",";
  body += "\"targetYawDeg\":" + String(snap.targetYawDeg, 3) + ",";
  body += "\"errorForwardCm\":" + String(snap.positionErrorForwardCm, 3) + ",";
  body += "\"errorStrafeCm\":" + String(snap.positionErrorStrafeCm, 3) + ",";
  body += "\"errorYawDeg\":" + String(snap.positionErrorYawDeg, 3) + ",";
  body += "\"kp\":" + String(snap.positionKp, 4) + ",";
  body += "\"ki\":" + String(snap.positionKi, 4) + ",";
  body += "\"yawKp\":" + String(snap.yawKp, 4) + ",";
  body += "\"yawKi\":" + String(snap.yawKi, 4) + ",";
  body += "\"maxRpm\":" + String(snap.positionMaxRpm, 3) + ",";
  body += "\"toleranceCm\":" + String(snap.positionToleranceCm, 3) + ",";
  body += "\"yawToleranceDeg\":" + String(snap.yawToleranceDeg, 3) + ",";
  body += "\"pTerm\":";
  appendFloatArray3(body, snap.positionPTerm, 3);
  body += ",\"iTerm\":";
  appendFloatArray3(body, snap.positionITerm, 3);
  body += ",\"outputRpm\":";
  appendFloatArray3(body, snap.positionOutputRpm, 3);
  body += "},";
  body += "\"rawTargetRpm\":";
  appendFloatArray(body, snap.rawTargetRpm, 3);
  body += ",";
  body += "\"targetRpm\":";
  appendFloatArray(body, snap.targetRpm, 3);
  body += ",\"appliedTargetRpm\":";
  appendFloatArray(body, snap.appliedTargetRpm, 3);
  body += ",\"rawRpm\":";
  appendFloatArray(body, snap.rawRpm, 3);
  body += ",\"rpm\":";
  appendFloatArray(body, snap.measuredRpm, 3);
  body += ",\"errorRpm\":";
  appendFloatArray(body, snap.errorRpm, 3);
  body += ",\"pTerm\":";
  appendFloatArray(body, snap.pTerm, 3);
  body += ",\"iTerm\":";
  appendFloatArray(body, snap.iTerm, 3);
  body += ",\"rawOutput\":";
  appendFloatArray(body, snap.rawOutput, 3);
  body += ",\"output\":";
  appendFloatArray(body, snap.output, 3);
  body += ",\"integralError\":";
  appendFloatArray(body, snap.integralError, 3);
  body += ",\"pwm\":";
  appendInt16Array(body, snap.pwm);
  body += ",\"hardwarePwm\":";
  appendInt16Array(body, snap.hardwarePwm);
  body += ",\"encoderSign\":";
  appendInt8Array(body, snap.encoderSign);
  body += ",\"motorSign\":";
  appendInt8Array(body, snap.motorSign);
  body += ",\"rawEncoderCounts\":";
  appendInt32Array(body, snap.rawCounts);
  body += ",\"signedEncoderCounts\":";
  appendInt32Array(body, snap.signedCounts);
  body += "}";
  return body;
}

void sendJsonLine(const String& line) {
  SERIAL_LOCK();
  Serial.println(line);
  SERIAL_UNLOCK();
}

const char* piResultText(uint8_t code) {
  switch (code) {
    case 1: return "completed";
    case 2: return "stopped";
    default: return "idle";
  }
}

