nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
const char* piModeText() {
  if (positionModeActive) return "driving";
  if (timedRunActive) return "timed";
  return "idle";
}

float piPoseForwardCm() {
  return piMoveActive ? (piMoveStartForwardCm + displayedOdomForwardCm()) : piOdomForwardCm;
}

float piPoseStrafeCm() {
  return piMoveActive ? (piMoveStartStrafeCm + displayedOdomStrafeCm()) : piOdomStrafeCm;
}

void latchPiMoveOdom() {
  if (!piMoveActive) {
    return;
  }
  piOdomForwardCm = piMoveStartForwardCm + displayedOdomForwardCm();
  piOdomStrafeCm = piMoveStartStrafeCm + displayedOdomStrafeCm();
  piMoveActive = false;
}

void resetPiBridgeOdom() {
  piOdomForwardCm = 0.0f;
  piOdomStrafeCm = 0.0f;
  piMoveStartForwardCm = 0.0f;
  piMoveStartStrafeCm = 0.0f;
  piMoveActive = false;
}

void queuePiDone(uint32_t seq, uint8_t code) {
  if (seq == 0) {
    return;
  }
  piPendingDone = true;
  piPendingDoneSeq = seq;
  piPendingDoneCode = code;
}

String buildPiAckJson(uint32_t seq, const char* cmd, bool ok, const String& message) {
  String s;
  s.reserve(160);
  s += "{\"type\":\"ack\",\"seq\":" + String(seq);
  s += ",\"cmd\":\"" + String(cmd) + "\"";
  s += ",\"ok\":" + String(ok ? "true" : "false");
  s += ",\"message\":\"" + message + "\"}";
  return s;
}

String buildPiLimitStatusJson(uint32_t seq, uint8_t pin, bool activeLow, int raw) {
  bool pressed = activeLow ? raw == LOW : raw == HIGH;
  String s;
  s.reserve(140);
  s += "{\"type\":\"limit\",\"seq\":" + String(seq);
  s += ",\"pin\":" + String(pin);
  s += ",\"pressed\":" + String(pressed ? "true" : "false");
  s += ",\"raw\":" + String(raw);
  s += ",\"activeLow\":" + String(activeLow ? "true" : "false");
  s += "}";
  return s;
}

String buildPiDoneJson(uint32_t seq, uint8_t code) {
  String s;
  s.reserve(220);
  s += "{\"type\":\"done\",\"seq\":" + String(seq);
  s += ",\"result\":\"" + String(piResultText(code)) + "\"";
  s += ",\"headingDeg\":" + String(displayedOdomYawDeg(), 2);
  s += ",\"forwardCm\":" + String(piPoseForwardCm(), 2);
  s += ",\"strafeCm\":" + String(piPoseStrafeCm(), 2);
  float localForward = displayedOdomForwardCm();
  float localStrafe = displayedOdomStrafeCm();
  s += ",\"progressCm\":" + String(sqrtf(localForward * localForward + localStrafe * localStrafe), 2);
  s += "}";
  return s;
}

String buildPiTelemetryJson() {
  String s;
  s.reserve(900);
  float localForward = displayedOdomForwardCm();
  float localStrafe = displayedOdomStrafeCm();
  float localProgress = sqrtf(localForward * localForward + localStrafe * localStrafe);
  float localRemaining = sqrtf(positionErrorForwardCm * positionErrorForwardCm + positionErrorStrafeCm * positionErrorStrafeCm);

  s += "{\"type\":\"telemetry\"";
  s += ",\"mode\":\"" + String(piModeText()) + "\"";
  s += ",\"seq\":" + String(piActiveSeq);
  s += ",\"imu\":{\"ok\":" + String(imuOk ? "true" : "false");
  s += ",\"headingUsesImu\":" + String(imuHeadingReady() ? "true" : "false");
  s += ",\"calValid\":" + String(imuCalValid ? "true" : "false");
  s += ",\"yawDeg\":" + String(displayedOdomYawDeg(), 3);
  s += ",\"rawYawDeg\":" + String(displayedImuYawRawDeg(), 3);
  s += ",\"controlYawDeg\":" + String(displayedImuYawDeg(), 3);
  s += ",\"encoderYawDeg\":" + String(encoderYawDeg(), 3);
  s += ",\"gyroDps\":" + String(displayedImuGyroDps(), 3);
  s += ",\"gyroFiltDps\":" + String(displayedImuGyroDpsFilt(), 3);
  s += ",\"biasDps\":" + String(imuBiasDps, 4);
  s += ",\"calStdDps\":" + String(imuCalStdDps, 4);
  s += "}";
  s += ",\"pose\":{\"forwardCm\":" + String(piPoseForwardCm(), 2);
  s += ",\"strafeCm\":" + String(piPoseStrafeCm(), 2);
  s += ",\"yawDeg\":" + String(displayedOdomYawDeg(), 2);
  s += ",\"progressCm\":" + String(localProgress, 2);
  s += ",\"remainingCm\":" + String(localRemaining, 2);
  s += ",\"localForwardCm\":" + String(localForward, 2);
  s += ",\"localStrafeCm\":" + String(localStrafe, 2);
  s += "}";
  s += ",\"move\":{\"phase\":" + String(positionModeActive ? 2 : 0);
  s += ",\"angleDeg\":" + String(piLastMoveAngleDeg, 2);
  s += ",\"distanceCm\":" + String(piLastMoveDistanceCm, 2);
  s += ",\"headingTargetDeg\":" + String(targetYawDeg, 2);
  s += ",\"headingErrorDeg\":" + String(positionErrorYawDeg, 2);
  s += ",\"done\":" + String(positionTargetReached ? "true" : "false");
  s += "}";
  s += ",\"rpm\":[" + String(measuredRpm[0], 2) + "," + String(measuredRpm[1], 2) + "," + String(measuredRpm[2], 2) + "," + String(measuredRpm[3], 2) + "]";
  s += ",\"targetRpm\":[" + String(targetRpm[0], 2) + "," + String(targetRpm[1], 2) + "," + String(targetRpm[2], 2) + "," + String(targetRpm[3], 2) + "]";
  s += ",\"pwm\":[" + String(pwmCmd[0]) + "," + String(pwmCmd[1]) + "," + String(pwmCmd[2]) + "," + String(pwmCmd[3]) + "]";
  s += ",\"rawEncoderCounts\":[" + String(readEncoderCount(motors[0].encoderIndex)) + "," + String(readEncoderCount(motors[1].encoderIndex)) + "," + String(readEncoderCount(motors[2].encoderIndex)) + "," + String(readEncoderCount(motors[3].encoderIndex)) + "]";
  s += ",\"signedEncoderCounts\":[" + String(((int32_t)encoderSign[0]) * readEncoderCount(motors[0].encoderIndex)) + "," + String(((int32_t)encoderSign[1]) * readEncoderCount(motors[1].encoderIndex)) + "," + String(((int32_t)encoderSign[2]) * readEncoderCount(motors[2].encoderIndex)) + "," + String(((int32_t)encoderSign[3]) * readEncoderCount(motors[3].encoderIndex)) + "]";
  s += "}";
  return s;
}

bool extractArg(const String& line, const char* key, String& valueOut) {
  String pattern = String(key) + "=";
  int start = line.indexOf(pattern);
  if (start < 0) {
    return false;
  }
  start += pattern.length();
  int end = line.indexOf(' ', start);
  if (end < 0) {
    end = line.length();
  }
  valueOut = line.substring(start, end);
  return true;
}

float getFloatArg(const String& line, const char* key, float defaultValue) {
  String value;
  if (!extractArg(line, key, value)) {
    return defaultValue;
  }
  return value.toFloat();
}

uint32_t getUIntArg(const String& line, const char* key, uint32_t defaultValue) {
  String value;
  if (!extractArg(line, key, value)) {
    return defaultValue;
  }
  return (uint32_t)value.toInt();
}

