nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
String firstToken(const String& line) {
  int sp = line.indexOf(' ');
  if (sp < 0) {
    return line;
  }
  return line.substring(0, sp);
}

void stopPiMotion(uint8_t resultCode) {
  uint32_t oldSeq = piActiveSeq;
  latchPiMoveOdom();
  piActiveSeq = 0;
  controllerEnabled = false;
  positionModeActive = false;
  positionTargetReached = false;
  timedRunActive = false;
  timedRunStartMs = 0;
  commandForwardRpm = 0.0f;
  commandStrafeRpm = 0.0f;
  commandRotateRpm = 0.0f;
  updateMecanumTargets();
  resetAllPiStates();
  resetAllBodyPiStates();
  stopAllMotors();
  queuePiDone(oldSeq, resultCode);
}

void startPiPositionMove(uint32_t seq, float angleDeg, float distanceCm, float headingDeg) {
  if (piActiveSeq != 0) {
    stopPiMotion(2);
  }

  if (distanceCm < 0.0f) {
    distanceCm = -distanceCm;
    angleDeg = wrapAngleDeg(angleDeg + 180.0f);
  }

  float rad = angleDeg * DEG_TO_RAD;
  targetForwardCm = cosf(rad) * distanceCm;
  targetStrafeCm = -sinf(rad) * distanceCm;
  targetYawDeg = wrapAngleDeg(headingDeg);

  positionMoveId++;
  if (positionMoveId == 0) positionMoveId = 1;
  piActiveSeq = seq;
  piMoveActive = true;
  piMoveStartForwardCm = piOdomForwardCm;
  piMoveStartStrafeCm = piOdomStrafeCm;
  piLastMoveAngleDeg = angleDeg;
  piLastMoveDistanceCm = distanceCm;

  resetOdometryToCurrentCounts();
  resetRpmMeasurementsToCurrentCounts();
  resetAllPiStates();
  resetAllBodyPiStates();
  positionErrorForwardCm = targetForwardCm;
  positionErrorStrafeCm = targetStrafeCm;
  positionErrorYawDeg = shortestAngleErrorDeg(targetYawDeg, displayedOdomYawDeg());
  positionTargetReached = false;
  positionModeActive = true;
  timedRunActive = false;
  timedRunStartMs = 0;
  controllerEnabled = true;
  updatePositionController(NOMINAL_DT_S);
}

void startPiTwist(float forwardRpm, float strafeRpm, float turnRpm, uint32_t timeoutMs) {
  if (piActiveSeq != 0) {
    stopPiMotion(2);
  }

  latchPiMoveOdom();
  piActiveSeq = 0;
  positionModeActive = false;
  positionTargetReached = false;
  timedRunActive = false;
  timedRunStartMs = 0;

  commandForwardRpm = constrain(forwardRpm, -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  commandStrafeRpm = constrain(strafeRpm, -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  commandRotateRpm = constrain(turnRpm, -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  updateMecanumTargets();

  if (fabsf(commandForwardRpm) <= 0.001f &&
      fabsf(commandStrafeRpm) <= 0.001f &&
      fabsf(commandRotateRpm) <= 0.001f) {
    controllerEnabled = false;
    resetAllPiStates();
    resetAllBodyPiStates();
    stopAllMotors();
    return;
  }

  timedRunDurationMs = timeoutMs < 50 ? 50 : timeoutMs;
  timedRunStartMs = millis();
  timedRunId++;
  if (timedRunId == 0) timedRunId = 1;
  timedRunActive = true;
  controllerEnabled = true;
  resetAllPiStates();
  resetAllBodyPiStates();
  resetRpmMeasurementsToCurrentCounts();
}

void handlePiCommandLine(String line) {
  line.trim();
  if (line.length() == 0) {
    return;
  }

  String cmd = firstToken(line);
  cmd.toUpperCase();
  uint32_t seq = getUIntArg(line, "seq", 0);

  if (cmd == "PING") {
    sendJsonLine("{\"type\":\"pong\",\"seq\":" + String(seq) + ",\"ok\":true}");
    return;
  }

  if (cmd == "STATUS") {
    sendJsonLine(buildPiAckJson(seq, "STATUS", true, "telemetry_follows"));
    STATE_LOCK();
    String telemetry = buildPiTelemetryJson();
    STATE_UNLOCK();
    sendJsonLine(telemetry);
    return;
  }

  if (cmd == "LIMIT_STATUS") {
    uint8_t pin = (uint8_t)getUIntArg(line, "pin", DEFAULT_LIMIT_STATUS_PIN);
    bool activeLow = getUIntArg(line, "activeLow", 1) != 0;
    pinMode(pin, activeLow ? INPUT_PULLUP : INPUT);
    delayMicroseconds(50);
    int raw = digitalRead(pin);
    sendJsonLine(buildPiLimitStatusJson(seq, pin, activeLow, raw));
    return;
  }

  if (cmd == "STOP") {
    STATE_LOCK();
    stopPiMotion(2);
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "STOP", true, "stopped"));
    return;
  }

  if (cmd == "RESET_ENC") {
    STATE_LOCK();
    resetEncoderMeasurements();
    resetOdometryToCurrentCounts();
    resetPiBridgeOdom();
    resetAllPiStates();
    resetAllBodyPiStates();
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "RESET_ENC", true, "encoders_reset"));
    return;
  }

  if (cmd == "RESET_ODOM") {
    STATE_LOCK();
    resetOdometryToCurrentCounts();
    resetPiBridgeOdom();
    positionErrorForwardCm = targetForwardCm;
    positionErrorStrafeCm = targetStrafeCm;
    positionErrorYawDeg = shortestAngleErrorDeg(targetYawDeg, displayedOdomYawDeg());
    resetAllBodyPiStates();
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "RESET_ODOM", true, "odometry_reset"));
    return;
  }

  if (cmd == "ZERO_IMU") {
    STATE_LOCK();
    stopPiMotion(2);
    imuYawDeg = 0.0f;
    imuYawRawDeg = 0.0f;
    targetYawDeg = 0.0f;
    positionErrorYawDeg = 0.0f;
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "ZERO_IMU", true, "yaw_zeroed"));
    return;
  }

  if (cmd == "CAL_IMU") {
    bool ok = false;
    STATE_LOCK();
    stopPiMotion(2);
    ok = imuCalibrateBias(500);
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "CAL_IMU", ok, ok ? "imu_bias_calibrated" : "imu_calibration_failed"));
    return;
  }

  if (cmd == "INIT_IMU") {
    bool ok = false;
    bool imuPresent = false;
    STATE_LOCK();
    stopPiMotion(2);
    imuPresent = imuOk;
    if (imuOk) {
      ok = imuCalibrateBias(500);
      if (ok) {
        imuYawDeg = 0.0f;
        imuYawRawDeg = 0.0f;
        targetYawDeg = 0.0f;
        positionErrorYawDeg = 0.0f;
      }
    }
    STATE_UNLOCK();
    if (imuPresent) {
      sendJsonLine(buildPiAckJson(seq, "INIT_IMU", ok, ok ? "imu_calibrated_and_zeroed" : "imu_calibration_failed"));
    } else {
      sendJsonLine(buildPiAckJson(seq, "INIT_IMU", true, "imu_missing_using_encoder_heading"));
    }
    return;
  }

  if (cmd == "MOVE") {
    float angleDeg = getFloatArg(line, "angle", 0.0f);
    float distCm = getFloatArg(line, "dist", 0.0f);
    float headingDeg = getFloatArg(line, "heading", 0.0f);
    STATE_LOCK();
    startPiPositionMove(seq, angleDeg, distCm, headingDeg);
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "MOVE", true, "accepted"));
    return;
  }

  if (cmd == "TWIST") {
    float forwardRpm = getFloatArg(line, "forward", 0.0f);
    float strafeRpm = getFloatArg(line, "strafe", 0.0f);
    float turnRpm = getFloatArg(line, "turn", 0.0f);
    uint32_t timeoutMs = getUIntArg(line, "timeout", 300);
    STATE_LOCK();
    startPiTwist(forwardRpm, strafeRpm, turnRpm, timeoutMs);
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "TWIST", true, "accepted"));
    return;
  }

  if (cmd == "TURN") {
    float headingDeg = getFloatArg(line, "heading", 0.0f);
    STATE_LOCK();
    startPiPositionMove(seq, 0.0f, 0.0f, headingDeg);
    STATE_UNLOCK();
    sendJsonLine(buildPiAckJson(seq, "TURN", true, "accepted"));
    return;
  }

  sendJsonLine(buildPiAckJson(seq, "UNKNOWN", false, "unknown_command"));
}

const char INDEX_HTML[] PROGMEM = R"HTML(
<!doctype html>
<html>
<head>
  <meta charset="utf-8" />
  <meta name="viewport" content="width=device-width,initial-scale=1" />
  <title>Clean Mecanum Position</title>
  <style>
    :root {
      color-scheme: dark;
      --bg: #0b0f14;
      --panel: #111923;
      --panel-2: #172331;
      --line: #2b3a4d;
      --text: #eef4fb;
      --muted: #9cb0c7;
      --accent: #2ec4a6;
      --danger: #d95d63;
      --warn: #f0b65a;
      --blue: #7bb7ff;
      --pink: #ff7ab6;
      --lime: #b7df58;
    }
    * { box-sizing: border-box; letter-spacing: 0; }
    body {
      margin: 0;
      background: var(--bg);
      color: var(--text);
      font-family: Segoe UI, Tahoma, Arial, sans-serif;
    }
    main { max-width: 1180px; margin: 0 auto; padding: 20px 14px 28px; }
    h1 { margin: 0 0 4px; font-size: 28px; font-weight: 650; }
    h2 { margin: 0 0 12px; font-size: 17px; font-weight: 600; }
    p { margin: 0; color: var(--muted); line-height: 1.45; }
    .band {
      border: 1px solid var(--line);
      border-radius: 8px;
      background: var(--panel);
      padding: 14px;
      margin-top: 12px;
    }
    .controls {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(130px, 1fr));
      gap: 10px;
      align-items: end;
    }
    label { display: grid; gap: 5px; color: var(--muted); font-size: 13px; min-width: 0; }
    input, select, button {
      width: 100%;
      min-width: 0;
      min-height: 38px;
      border-radius: 6px;
      border: 1px solid var(--line);
      background: #0d141c;
      color: var(--text);
      font: inherit;
      padding: 8px 10px;
    }
    button { cursor: pointer; font-weight: 600; }
    button.primary { background: var(--accent); border-color: var(--accent); color: #04110e; }
    button.stop { background: var(--danger); border-color: var(--danger); color: #fff; }
    button.flat { background: var(--panel-2); }
    .actions { display: flex; flex-wrap: wrap; gap: 8px; margin-top: 10px; }
    .status {
      display: flex;
      flex-wrap: wrap;
      gap: 8px 16px;
      padding-top: 12px;
      color: var(--muted);
      font-size: 14px;
    }
    .status strong { color: var(--text); }
    .gain-grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(170px, 1fr));
      gap: 10px;
      margin-top: 10px;
    }
    .gain-cell {
      min-width: 0;
      border: 1px solid var(--line);
      border-radius: 7px;
      background: var(--panel-2);
      padding: 10px;
    }
    .gain-cell strong {
      display: block;
      margin-bottom: 8px;
      font-size: 13px;
    }
    .gain-inputs {
      display: grid;
      grid-template-columns: repeat(2, minmax(0, 1fr));
      gap: 8px;
    }
    .metric-grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(160px, 1fr));
      gap: 10px;
    }
    .metric {
      border: 1px solid var(--line);
      border-radius: 7px;
      background: var(--panel-2);
      padding: 12px;
    }
    .metric span {
      display: block;
      color: var(--muted);
      font-size: 12px;
      margin-bottom: 8px;
    }
    .metric strong {
      display: block;
      font-size: 24px;
      font-variant-numeric: tabular-nums;
    }
    .plot {
      border: 1px solid var(--line);
      border-radius: 7px;
      background: var(--panel-2);
      padding: 10px;
    }
    .plot-grid {
      display: grid;
      grid-template-columns: repeat(auto-fit, minmax(280px, 1fr));
      gap: 10px;
    }
    .plot-head {
      display: flex;
      justify-content: space-between;
      align-items: baseline;
      gap: 10px;
      margin-bottom: 8px;
    }
    .plot-head strong { font-size: 14px; font-weight: 600; }
    .plot-head span { color: var(--muted); font-size: 12px; text-align: right; }
    canvas {
      display: block;
      width: 100%;
      height: 340px;
      border-radius: 6px;
      background: #0d141c;
    }
    .legend {
      display: flex;
      flex-wrap: wrap;
      gap: 12px;
      color: var(--muted);
      font-size: 12px;
      padding-top: 8px;
    }
    .key { display: inline-flex; align-items: center; gap: 5px; }
    .key::before {
      content: "";
      display: inline-block;
      width: 16px;
      height: 3px;
      border-radius: 99px;
      background: var(--c);
    }
    .table-wrap { overflow-x: auto; }
    table { width: 100%; min-width: 1040px; border-collapse: collapse; }
    th, td { border-bottom: 1px solid var(--line); padding: 9px 8px; text-align: right; font-variant-numeric: tabular-nums; }
    th { color: var(--muted); font-size: 12px; font-weight: 600; }
    td:first-child, th:first-child { text-align: left; }
    .note { color: var(--warn); font-size: 13px; padding-top: 10px; }
    @media (max-width: 760px) {
      main { padding-top: 14px; }
      h1 { font-size: 23px; }
      canvas { height: 260px; }
    }
  </style>
</head>
<body>
  <main>
    <h1>Clean Mecanum Position</h1>
    <p>Outer body-position commands generate velocity targets for the tuned inner wheel PI loops. Logical wheel order is BR, FR, BL, FL.</p>

    <section class="band">
      <h2>Body Velocity Command</h2>
      <div class="controls">
        <label>Forward RPM<input id="forward" type="number" min="-45" max="45" step="0.5" value="0" /></label>
        <label>Strafe RPM<input id="strafe" type="number" min="-45" max="45" step="0.5" value="0" /></label>
        <label>Rotate RPM<input id="rotate" type="number" min="-45" max="45" step="0.5" value="0" /></label>
        <label>Timed Test Seconds<input id="duration" type="number" min="0.25" max="120" step="0.25" value="3" /></label>
        <label>Strafe Sign
          <select id="strafeSign">
            <option value="1">Normal</option>
            <option value="-1">Invert</option>
          </select>
        </label>
        <label>Rotate Sign
          <select id="rotateSign">
            <option value="1">Normal</option>
            <option value="-1">Invert</option>
          </select>
        </label>
        <label>Odom Forward Sign
          <select id="odomForwardSign">
            <option value="1">Normal</option>
            <option value="-1">Invert</option>
          </select>
        </label>
        <label>Odom Strafe Sign
          <select id="odomStrafeSign">
            <option value="1">Normal</option>
            <option value="-1">Invert</option>
          </select>
        </label>
        <label>Odom Rotate Sign
          <select id="odomYawSign">
            <option value="1">Normal</option>
            <option value="-1">Invert</option>
          </select>
        </label>
      </div>
      <div class="gain-grid">
        <div class="gain-cell">
          <strong>BR PI</strong>
          <div class="gain-inputs">
            <label>Kp<input id="kp0" type="number" min="0" step="0.05" value="15" /></label>
            <label>Ki<input id="ki0" type="number" min="0" step="0.05" value="200" /></label>
          </div>
        </div>
        <div class="gain-cell">
          <strong>FR PI</strong>
          <div class="gain-inputs">
            <label>Kp<input id="kp1" type="number" min="0" step="0.05" value="15" /></label>
            <label>Ki<input id="ki1" type="number" min="0" step="0.05" value="200" /></label>
          </div>
        </div>
        <div class="gain-cell">
          <strong>BL PI</strong>
          <div class="gain-inputs">
            <label>Kp<input id="kp2" type="number" min="0" step="0.05" value="15" /></label>
            <label>Ki<input id="ki2" type="number" min="0" step="0.05" value="200" /></label>
          </div>
        </div>
        <div class="gain-cell">
          <strong>FL PI</strong>
          <div class="gain-inputs">
            <label>Kp<input id="kp3" type="number" min="0" step="0.05" value="15" /></label>
            <label>Ki<input id="ki3" type="number" min="0" step="0.05" value="200" /></label>
          </div>
        </div>
      </div>
      <div class="actions">
        <button class="flat" onclick="setBody(30,0,0)">Forward</button>
        <button class="flat" onclick="setBody(-30,0,0)">Backward</button>
        <button class="flat" onclick="setBody(0,30,0)">Strafe +</button>
        <button class="flat" onclick="setBody(0,-30,0)">Strafe -</button>
        <button class="flat" onclick="setBody(0,0,25)">Rotate +</button>
        <button class="flat" onclick="setBody(0,0,-25)">Rotate -</button>
        <button class="flat" onclick="setBody(0,0,0)">Zero Command</button>
        <button class="flat" onclick="applyConfig()">Apply</button>
        <button class="primary" onclick="startController()">Start</button>
        <button class="primary" onclick="startTimedTest()">Run Timed Test</button>
        <button class="stop" onclick="stopController()">Stop</button>
        <button class="flat" onclick="resetIntegral()">Reset Integral</button>
        <button class="flat" onclick="resetEncoders()">Reset Encoders</button>
        <button class="flat" onclick="resetOdometry()">Reset Odometry</button>
        <button class="flat" onclick="clearTimedPlot()">Clear Timed Plot</button>
      </div>
      <div class="status">
        <span>Status <strong id="runState">STOPPED</strong></span>
        <span>Timed run <strong id="timedState">IDLE</strong></span>
        <span>Loop dt <strong id="dt">0</strong> ms</span>
        <span>Limit <strong id="limit">0</strong> RPM</span>
        <span>Target scale <strong id="scale">1.00</strong></span>
        <span>CPR <strong id="cpr">0</strong></span>
        <span>RPM filter alpha <strong id="alpha">0</strong></span>
      </div>
      <div class="note">Manual velocity mode is still available for tuning. Position moves use the cascaded outer loop below.</div>
    </section>

    <section class="band">
      <h2>Position Move</h2>
      <div class="controls">
        <label>Forward Target cm<input id="moveForward" type="number" step="1" value="30" /></label>
        <label>Strafe Target cm<input id="moveStrafe" type="number" step="1" value="0" /></label>
        <label>Rotate Target deg<input id="moveYaw" type="number" step="1" value="0" /></label>
        <label>Position Kp rpm/cm<input id="positionKp" type="number" min="0" step="0.05" value="100" /></label>
        <label>Heading Kp rpm/deg<input id="yawKp" type="number" min="0" step="0.05" value="10" /></label>
        <label>Position Max RPM<input id="positionMaxRpm" type="number" min="1" max="45" step="1" value="40" /></label>
        <label>Position Tolerance cm<input id="positionToleranceCm" type="number" min="0.1" max="10" step="0.1" value="2.0" /></label>
        <label>Heading Tolerance deg<input id="yawToleranceDeg" type="number" min="0.5" max="15" step="0.5" value="2.0" /></label>
        <label>Forward Odom Scale<input id="odomForwardScale" type="number" min="0.5" max="1.5" step="0.0005" value="0.9854" /></label>
        <label>Strafe Odom Scale<input id="odomStrafeScale" type="number" min="0.5" max="1.5" step="0.0005" value="0.9375" /></label>
      </div>
      <div class="actions">
        <button class="primary" onclick="startPositionMove()">Start Position Move</button>
        <button class="flat" onclick="setMove(30,0,0)">Forward 30 cm</button>
        <button class="flat" onclick="setMove(-30,0,0)">Backward 30 cm</button>
        <button class="flat" onclick="setMove(0,30,0)">Right 30 cm</button>
        <button class="flat" onclick="setMove(0,-30,0)">Left 30 cm</button>
        <button class="flat" onclick="setMove(0,0,45)">CCW 45 deg</button>
        <button class="flat" onclick="setMove(0,0,-45)">CW 45 deg</button>
        <button class="flat" onclick="imuZero()">Zero IMU Heading</button>
        <button class="flat" onclick="imuCalibrate()">Calibrate IMU Bias</button>
      </div>
      <div class="status">
        <span>Position mode <strong id="positionMode">IDLE</strong></span>
        <span>Forward target <strong id="targetForward">0.00</strong> cm</span>
        <span>Strafe target <strong id="targetStrafe">0.00</strong> cm</span>
        <span>Heading target <strong id="targetYaw">0.00</strong> deg</span>
        <span>Heading source <strong id="headingSource">ENCODER</strong></span>
      </div>
      <div class="note">Position control is cascaded: body position Kp outside, wheel velocity PI inside. Heading adds internal gyro-rate damping near the target.</div>
    </section>

    <section class="band">
      <h2>Encoder Odometry</h2>
      <div class="metric-grid">
        <div class="metric"><span>Forward travel cm</span><strong id="odomForward">0.00</strong></div>
        <div class="metric"><span>Strafe travel cm</span><strong id="odomStrafe">0.00</strong></div>
        <div class="metric"><span>Heading deg</span><strong id="odomYaw">0.00</strong></div>
        <div class="metric"><span>Forward error cm</span><strong id="errorForward">0.00</strong></div>
        <div class="metric"><span>Strafe error cm</span><strong id="errorStrafe">0.00</strong></div>
        <div class="metric"><span>Heading error deg</span><strong id="errorYaw">0.00</strong></div>
      </div>
    </section>

    <section class="band">
      <h2>Heading Diagnostics</h2>
      <div class="metric-grid">
        <div class="metric"><span>Control yaw deg</span><strong id="imuYaw">0.00</strong></div>
        <div class="metric"><span>Raw yaw deg</span><strong id="imuYawRaw">0.00</strong></div>
        <div class="metric"><span>Gyro Z dps</span><strong id="imuGyro">0.00</strong></div>
        <div class="metric"><span>Filtered gyro Z dps</span><strong id="imuGyroFilt">0.00</strong></div>
        <div class="metric"><span>Gyro bias dps</span><strong id="imuBias">0.000</strong></div>
        <div class="metric"><span>Calibration std dps</span><strong id="imuCalStd">0.000</strong></div>
      </div>
    </section>

    <section class="band">
      <h2>Position Response</h2>
      <div class="plot-grid">
        <div class="plot">
          <div class="plot-head"><strong>Forward Position</strong><span id="posLiveMeta0">Waiting</span></div>
          <canvas id="posLive0"></canvas>
          <div class="legend"><span class="key" style="--c:#f0b65a">target</span><span class="key" style="--c:#2ec4a6">measured</span></div>
        </div>
        <div class="plot">
          <div class="plot-head"><strong>Strafe Position</strong><span id="posLiveMeta1">Waiting</span></div>
          <canvas id="posLive1"></canvas>
          <div class="legend"><span class="key" style="--c:#f0b65a">target</span><span class="key" style="--c:#7bb7ff">measured</span></div>
        </div>
        <div class="plot">
          <div class="plot-head"><strong>Heading</strong><span id="posLiveMeta2">Waiting</span></div>
          <canvas id="posLive2"></canvas>
          <div class="legend"><span class="key" style="--c:#f0b65a">target</span><span class="key" style="--c:#ff7ab6">measured</span></div>
        </div>
      </div>
    </section>

    <section class="band">
      <h2>Held Position Move</h2>
      <div class="plot-grid">
        <div class="plot">
          <div class="plot-head"><strong>Forward Capture</strong><span id="posHeldMeta0">No move captured</span></div>
          <canvas id="posHeld0"></canvas>
        </div>
        <div class="plot">
          <div class="plot-head"><strong>Strafe Capture</strong><span id="posHeldMeta1">No move captured</span></div>
          <canvas id="posHeld1"></canvas>
        </div>
        <div class="plot">
          <div class="plot-head"><strong>Heading Capture</strong><span id="posHeldMeta2">No move captured</span></div>
          <canvas id="posHeld2"></canvas>
        </div>
      </div>
    </section>

    <section class="band">
      <h2>Velocity Response</h2>
      <div class="plot">
        <div class="plot-head">
          <strong>Live All-Wheel Response</strong>
          <span id="liveMeta">Waiting for samples</span>
        </div>
        <canvas id="livePlot"></canvas>
        <div class="legend">
          <span class="key" style="--c:#2ec4a6">BR measured</span>
          <span class="key" style="--c:#7bb7ff">FR measured</span>
          <span class="key" style="--c:#ff7ab6">BL measured</span>
          <span class="key" style="--c:#b7df58">FL measured</span>
          <span class="key" style="--c:#f0b65a">targets</span>
        </div>
      </div>
    </section>

