nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
    <section class="band">
      <h2>Timed Test Capture</h2>
      <div class="plot">
        <div class="plot-head">
          <strong>Held Response</strong>
          <span id="timedMeta">No timed test captured</span>
        </div>
        <canvas id="timedPlot"></canvas>
        <div class="legend">
          <span class="key" style="--c:#2ec4a6">BR measured</span>
          <span class="key" style="--c:#7bb7ff">FR measured</span>
          <span class="key" style="--c:#ff7ab6">BL measured</span>
          <span class="key" style="--c:#b7df58">FL measured</span>
          <span class="key" style="--c:#f0b65a">targets</span>
        </div>
      </div>
    </section>

    <section class="band">
      <h2>Wheel Telemetry</h2>
      <div class="table-wrap">
        <table>
          <thead>
            <tr>
              <th>Wheel</th><th>Target</th><th>Raw RPM</th><th>Filtered RPM</th><th>Error</th>
              <th>P</th><th>I</th><th>Raw Out</th><th>PWM</th><th>HW PWM</th>
              <th>Integral</th><th>Signed Count</th><th>Raw Count</th><th>Enc Sign</th><th>Motor Sign</th>
            </tr>
          </thead>
          <tbody>
            <tr><td>BR</td><td id="tar0">0</td><td id="raw0">0</td><td id="rpm0">0</td><td id="err0">0</td><td id="p0">0</td><td id="i0">0</td><td id="u0">0</td><td id="pwm0">0</td><td id="hpwm0">0</td><td id="int0">0</td><td id="cnt0">0</td><td id="rawCnt0">0</td><td id="sgn0">0</td><td id="msgn0">0</td></tr>
            <tr><td>FR</td><td id="tar1">0</td><td id="raw1">0</td><td id="rpm1">0</td><td id="err1">0</td><td id="p1">0</td><td id="i1">0</td><td id="u1">0</td><td id="pwm1">0</td><td id="hpwm1">0</td><td id="int1">0</td><td id="cnt1">0</td><td id="rawCnt1">0</td><td id="sgn1">0</td><td id="msgn1">0</td></tr>
            <tr><td>BL</td><td id="tar2">0</td><td id="raw2">0</td><td id="rpm2">0</td><td id="err2">0</td><td id="p2">0</td><td id="i2">0</td><td id="u2">0</td><td id="pwm2">0</td><td id="hpwm2">0</td><td id="int2">0</td><td id="cnt2">0</td><td id="rawCnt2">0</td><td id="sgn2">0</td><td id="msgn2">0</td></tr>
            <tr><td>FL</td><td id="tar3">0</td><td id="raw3">0</td><td id="rpm3">0</td><td id="err3">0</td><td id="p3">0</td><td id="i3">0</td><td id="u3">0</td><td id="pwm3">0</td><td id="hpwm3">0</td><td id="int3">0</td><td id="cnt3">0</td><td id="rawCnt3">0</td><td id="sgn3">0</td><td id="msgn3">0</td></tr>
          </tbody>
        </table>
      </div>
    </section>
  </main>
  <script>
    const field = (id) => document.getElementById(id);
    const fmt = (value, digits = 2) => Number(value || 0).toFixed(digits);
    const colors = ['#2ec4a6', '#7bb7ff', '#ff7ab6', '#b7df58'];
    const names = ['BR', 'FR', 'BL', 'FL'];
    const liveWindowMs = 20000;
    let formLoaded = false;
    let latestData = null;
    let liveHistory = [];
    let timedHistory = [];
    let positionLiveHistory = [];
    let positionHeldHistory = [];
    let timedRunId = -1;
    let lastTimedSampleMs = -1;
    let positionMoveId = -1;
    let lastPositionSampleMs = -1;

    async function call(path) {
      const response = await fetch(path);
      if (!response.ok) throw new Error(await response.text());
      return response.text();
    }

    function clampRpm(value, limit = 45) {
      return Math.min(limit, Math.max(-limit, Number(value || 0)));
    }

    function setBody(forward, strafe, rotate) {
      field('forward').value = forward;
      field('strafe').value = strafe;
      field('rotate').value = rotate;
    }

    function setMove(forward, strafe, yaw) {
      field('moveForward').value = forward;
      field('moveStrafe').value = strafe;
      field('moveYaw').value = yaw;
    }

    function configQuery() {
      const params = new URLSearchParams({
        forward: field('forward').value,
        strafe: field('strafe').value,
        rotate: field('rotate').value,
        strafeSign: field('strafeSign').value,
        rotateSign: field('rotateSign').value,
        odomForwardSign: field('odomForwardSign').value,
        odomStrafeSign: field('odomStrafeSign').value,
        odomYawSign: field('odomYawSign').value,
        positionKp: field('positionKp').value,
        yawKp: field('yawKp').value,
        positionMaxRpm: field('positionMaxRpm').value,
        positionToleranceCm: field('positionToleranceCm').value,
        yawToleranceDeg: field('yawToleranceDeg').value,
        odomForwardScale: field('odomForwardScale').value,
        odomStrafeScale: field('odomStrafeScale').value
      });
      for (let i = 0; i < 4; i++) {
        params.set('kp' + i, field('kp' + i).value);
        params.set('ki' + i, field('ki' + i).value);
      }
      return params.toString();
    }

    function timedRunMs() {
      const seconds = Math.min(120, Math.max(0.25, Number(field('duration').value || 3)));
      field('duration').value = seconds;
      return Math.round(seconds * 1000);
    }

    async function applyConfig() {
      try {
        await call('/cmd/config?' + configQuery());
        await refresh();
      } catch (error) {
        alert(error.message);
      }
    }

    async function startPositionMove() {
      try {
        const params = configQuery()
          + '&targetForwardCm=' + encodeURIComponent(field('moveForward').value)
          + '&targetStrafeCm=' + encodeURIComponent(field('moveStrafe').value)
          + '&targetYawDeg=' + encodeURIComponent(field('moveYaw').value);
        await call('/cmd/positionStart?' + params);
        await refresh();
      } catch (error) {
        alert(error.message);
      }
    }

    async function startController() {
      try {
        await call('/cmd/start?' + configQuery());
        await refresh();
      } catch (error) {
        alert(error.message);
      }
    }

    async function startTimedTest() {
      try {
        await call('/cmd/timedStart?' + configQuery() + '&ms=' + timedRunMs());
        await refresh();
      } catch (error) {
        alert(error.message);
      }
    }

    async function stopController() { await call('/cmd/stop'); await refresh(); }
    async function resetIntegral() { await call('/cmd/resetI'); await refresh(); }
    async function resetEncoders() { await call('/cmd/resetEnc'); await refresh(); }
    async function resetOdometry() { await call('/cmd/resetOdom'); await refresh(); }
    async function imuZero() { await call('/cmd/imuZero'); await refresh(); }
    async function imuCalibrate() { await call('/cmd/imuCal'); await refresh(); }

