nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
    function clearTimedPlot() {
      timedHistory = [];
      lastTimedSampleMs = -1;
      drawPlots();
    }

    function appendLiveSample(data) {
      const sample = {
        t: Number(data.nowMs),
        target: data.appliedTargetRpm.map(Number),
        rpm: data.rpm.map(Number)
      };
      if (!liveHistory.length || sample.t !== liveHistory[liveHistory.length - 1].t) {
        liveHistory.push(sample);
      }
      const oldest = sample.t - liveWindowMs;
      while (liveHistory.length && liveHistory[0].t < oldest) liveHistory.shift();
    }

    function appendTimedSample(t, target, rpm) {
      if (!Number.isFinite(t) || t < 0 || t === lastTimedSampleMs) return;
      timedHistory.push({ t, target: target.map(Number), rpm: rpm.map(Number) });
      lastTimedSampleMs = t;
    }

    function captureTimedSample(data) {
      if (Number(data.timed.id) !== timedRunId) {
        timedRunId = Number(data.timed.id);
        if (timedRunId > 0) {
          timedHistory = [];
          lastTimedSampleMs = -1;
        }
      }
      if (timedRunId <= 0) return;
      const elapsed = Number(data.timed.elapsedMs);
      if (data.timed.active) {
        appendTimedSample(elapsed, data.appliedTargetRpm, data.rpm);
      } else if (timedHistory.length && elapsed > lastTimedSampleMs && elapsed <= Number(data.timed.durationMs)) {
        appendTimedSample(elapsed, timedHistory[timedHistory.length - 1].target, data.rpm);
      }
    }

    function positionSample(data) {
      return {
        t: Number(data.nowMs),
        moveId: Number(data.positionMoveId || 0),
        target: [
          Number(data.position.targetForwardCm),
          Number(data.position.targetStrafeCm),
          Number(data.position.targetYawDeg)
        ],
        measured: [
          Number(data.odometry.forwardCm),
          Number(data.odometry.strafeCm),
          Number(data.odometry.yawDeg)
        ],
        error: [
          Number(data.position.errorForwardCm),
          Number(data.position.errorStrafeCm),
          Number(data.position.errorYawDeg)
        ]
      };
    }

    function capturePositionSample(data) {
      const sample = positionSample(data);
      if (!positionLiveHistory.length || sample.t !== positionLiveHistory[positionLiveHistory.length - 1].t) {
        positionLiveHistory.push(sample);
      }

      const oldest = sample.t - liveWindowMs;
      while (positionLiveHistory.length && positionLiveHistory[0].t < oldest) positionLiveHistory.shift();

      if (sample.moveId !== positionMoveId) {
        positionMoveId = sample.moveId;
        if (positionMoveId > 0) {
          positionHeldHistory = [];
          lastPositionSampleMs = -1;
        }
      }

      if (positionMoveId <= 0) return;
      const lastHeld = positionHeldHistory[positionHeldHistory.length - 1];
      const shouldHold = data.positionModeActive || (positionHeldHistory.length && !lastHeld.done);
      if (shouldHold) {
        const relativeT = positionHeldHistory.length ? sample.t - positionHeldHistory[0].absoluteT : 0;
        if (sample.t !== lastPositionSampleMs) {
          positionHeldHistory.push({ ...sample, absoluteT: sample.t, t: Math.max(0, relativeT), done: !data.positionModeActive });
          lastPositionSampleMs = sample.t;
        }
      }
    }

    function sizeCanvas(canvas) {
      const rect = canvas.getBoundingClientRect();
      const scale = window.devicePixelRatio || 1;
      const width = Math.max(1, Math.floor(rect.width));
      const height = Math.max(1, Math.floor(rect.height));
      const pixelWidth = Math.floor(width * scale);
      const pixelHeight = Math.floor(height * scale);
      if (canvas.width !== pixelWidth || canvas.height !== pixelHeight) {
        canvas.width = pixelWidth;
        canvas.height = pixelHeight;
      }
      const ctx = canvas.getContext('2d');
      ctx.setTransform(scale, 0, 0, scale, 0, 0);
      return { ctx, width, height };
    }

    function plotLine(ctx, samples, xOf, yOf, source, wheel, color, width, dash) {
      let started = false;
      ctx.beginPath();
      for (const sample of samples) {
        const arr = sample[source];
        if (!arr) continue;
        const value = Number(arr[wheel]);
        if (!Number.isFinite(sample.t) || !Number.isFinite(value)) continue;
        const x = xOf(sample.t);
        const y = yOf(value);
        if (!started) {
          ctx.moveTo(x, y);
          started = true;
        } else {
          ctx.lineTo(x, y);
        }
      }
      ctx.strokeStyle = color;
      ctx.lineWidth = width;
      ctx.setLineDash(dash || []);
      ctx.stroke();
      ctx.setLineDash([]);
    }

    function drawPlot(canvas, samples, options) {
      const { ctx, width, height } = sizeCanvas(canvas);
      const left = 48;
      const right = 12;
      const top = 16;
      const bottom = 30;
      const plotWidth = Math.max(1, width - left - right);
      const plotHeight = Math.max(1, height - top - bottom);

      ctx.clearRect(0, 0, width, height);
      ctx.fillStyle = '#0d141c';
      ctx.fillRect(0, 0, width, height);

      if (!samples.length) {
        ctx.fillStyle = '#9cb0c7';
        ctx.font = '13px Segoe UI, Arial, sans-serif';
        ctx.textAlign = 'center';
        ctx.fillText(options.empty, width / 2, height / 2);
        return;
      }

      const latestT = samples[samples.length - 1].t;
      const xMin = options.live ? Math.max(0, latestT - liveWindowMs) : 0;
      const xMax = options.live ? Math.max(xMin + 1000, latestT) : Math.max(1000, Number(options.durationMs || 0), latestT);
      const visible = samples.filter((sample) => sample.t >= xMin && sample.t <= xMax);

      let maxAbs = 10;
      for (const sample of visible) {
        for (let i = 0; i < 4; i++) {
          maxAbs = Math.max(maxAbs, Math.abs(Number(sample.target[i]) || 0), Math.abs(Number(sample.rpm[i]) || 0));
        }
      }
      const yLimit = Math.ceil((maxAbs * 1.15) / 5) * 5;
      const xOf = (value) => left + ((value - xMin) / (xMax - xMin)) * plotWidth;
      const yOf = (value) => top + ((yLimit - value) / (2 * yLimit)) * plotHeight;

      ctx.font = '12px Segoe UI, Arial, sans-serif';
      ctx.lineWidth = 1;
      ctx.textBaseline = 'middle';
      ctx.textAlign = 'right';
      for (let i = 0; i <= 4; i++) {
        const value = yLimit - (i * yLimit) / 2;
        const y = yOf(value);
        ctx.strokeStyle = value === 0 ? '#51657d' : '#2b3a4d';
        ctx.beginPath();
        ctx.moveTo(left, y);
        ctx.lineTo(width - right, y);
        ctx.stroke();
        ctx.fillStyle = '#9cb0c7';
        ctx.fillText(fmt(value, 0), left - 7, y);
      }

