nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
      ctx.textBaseline = 'top';
      ctx.textAlign = 'center';
      for (let i = 0; i <= 4; i++) {
        const t = xMin + ((xMax - xMin) * i) / 4;
        const x = xOf(t);
        ctx.strokeStyle = '#2b3a4d';
        ctx.beginPath();
        ctx.moveTo(x, top);
        ctx.lineTo(x, height - bottom);
        ctx.stroke();
        const seconds = options.live ? (t - xMax) / 1000 : t / 1000;
        ctx.fillStyle = '#9cb0c7';
        ctx.fillText((seconds > 0 ? '+' : '') + fmt(seconds, options.live ? 0 : 1) + 's', x, height - bottom + 7);
      }

      ctx.textAlign = 'left';
      ctx.fillStyle = '#9cb0c7';
      ctx.fillText('RPM', 8, 4);
      for (let i = 0; i < 4; i++) plotLine(ctx, visible, xOf, yOf, 'target', i, '#f0b65a', 1, [5, 5]);
      for (let i = 0; i < 4; i++) plotLine(ctx, visible, xOf, yOf, 'rpm', i, colors[i], 2, []);
    }

    function drawPositionPlot(canvas, samples, axis, options) {
      const { ctx, width, height } = sizeCanvas(canvas);
      const left = 48;
      const right = 12;
      const top = 16;
      const bottom = 30;
      const plotWidth = Math.max(1, width - left - right);
      const plotHeight = Math.max(1, height - top - bottom);

      ctx.clearRect(0, 0, width, height);
      ctx.fillStyle = '#0d141c';
      ctx.fillRect(0, 0, width, height);

      if (!samples.length) {
        ctx.fillStyle = '#9cb0c7';
        ctx.font = '13px Segoe UI, Arial, sans-serif';
        ctx.textAlign = 'center';
        ctx.fillText(options.empty, width / 2, height / 2);
        return;
      }

      const latestT = samples[samples.length - 1].t;
      const xMin = options.live ? Math.max(0, latestT - liveWindowMs) : 0;
      const xMax = options.live ? Math.max(xMin + 1000, latestT) : Math.max(1000, latestT);
      const visible = samples.filter((sample) => sample.t >= xMin && sample.t <= xMax);

      let minValue = 0;
      let maxValue = 0;
      for (const sample of visible) {
        minValue = Math.min(minValue, Number(sample.target[axis]) || 0, Number(sample.measured[axis]) || 0);
        maxValue = Math.max(maxValue, Number(sample.target[axis]) || 0, Number(sample.measured[axis]) || 0);
      }
      const span = Math.max(5, maxValue - minValue);
      const yMin = Math.floor((minValue - span * 0.15) / 5) * 5;
      const yMax = Math.ceil((maxValue + span * 0.15) / 5) * 5;
      const xOf = (value) => left + ((value - xMin) / (xMax - xMin)) * plotWidth;
      const yOf = (value) => top + ((yMax - value) / Math.max(0.001, yMax - yMin)) * plotHeight;

      ctx.font = '12px Segoe UI, Arial, sans-serif';
      ctx.lineWidth = 1;
      ctx.textBaseline = 'middle';
      ctx.textAlign = 'right';
      for (let i = 0; i <= 4; i++) {
        const value = yMax - ((yMax - yMin) * i) / 4;
        const y = yOf(value);
        ctx.strokeStyle = Math.abs(value) < 0.0001 ? '#51657d' : '#2b3a4d';
        ctx.beginPath();
        ctx.moveTo(left, y);
        ctx.lineTo(width - right, y);
        ctx.stroke();
        ctx.fillStyle = '#9cb0c7';
        ctx.fillText(fmt(value, 0), left - 7, y);
      }

      ctx.textBaseline = 'top';
      ctx.textAlign = 'center';
      for (let i = 0; i <= 4; i++) {
        const t = xMin + ((xMax - xMin) * i) / 4;
        const x = xOf(t);
        ctx.strokeStyle = '#2b3a4d';
        ctx.beginPath();
        ctx.moveTo(x, top);
        ctx.lineTo(x, height - bottom);
        ctx.stroke();
        const seconds = options.live ? (t - xMax) / 1000 : t / 1000;
        ctx.fillStyle = '#9cb0c7';
        ctx.fillText((seconds > 0 ? '+' : '') + fmt(seconds, options.live ? 0 : 1) + 's', x, height - bottom + 7);
      }

      const drawSeries = (source, color, width, dash) => {
        let started = false;
        ctx.beginPath();
        for (const sample of visible) {
          const value = Number(sample[source][axis]);
          if (!Number.isFinite(sample.t) || !Number.isFinite(value)) continue;
          const x = xOf(sample.t);
          const y = yOf(value);
          if (!started) {
            ctx.moveTo(x, y);
            started = true;
          } else {
            ctx.lineTo(x, y);
          }
        }
        ctx.strokeStyle = color;
        ctx.lineWidth = width;
        ctx.setLineDash(dash || []);
        ctx.stroke();
        ctx.setLineDash([]);
      };

      ctx.textAlign = 'left';
      ctx.fillStyle = '#9cb0c7';
      ctx.fillText(options.unit, 8, 4);
      drawSeries('target', '#f0b65a', 1, [5, 5]);
      drawSeries('measured', colors[axis], 2, []);
    }

    function drawPlots() {
      field('liveMeta').textContent = liveHistory.length
        ? 'Last ' + fmt(liveWindowMs / 1000, 0) + ' s, ' + liveHistory.length + ' samples'
        : 'Waiting for samples';
      field('timedMeta').textContent = timedHistory.length
        ? 'Test #' + timedRunId + ', ' + fmt(timedHistory[timedHistory.length - 1].t / 1000, 2) + ' s captured'
        : 'No timed test captured';
      drawPlot(field('livePlot'), liveHistory, { live: true, empty: 'Live four-wheel RPM response will appear here.' });
      drawPlot(field('timedPlot'), timedHistory, {
        live: false,
        durationMs: latestData ? latestData.timed.durationMs : timedRunMs(),
        empty: 'Run a timed test to hold a four-wheel response plot here.'
      });
      const units = ['cm', 'cm', 'deg'];
      for (let axis = 0; axis < 3; axis++) {
        field('posLiveMeta' + axis).textContent = positionLiveHistory.length
          ? 'Last ' + fmt(liveWindowMs / 1000, 0) + ' s, ' + positionLiveHistory.length + ' samples'
          : 'Waiting';
        field('posHeldMeta' + axis).textContent = positionHeldHistory.length
          ? 'Move #' + positionMoveId + ', ' + fmt(positionHeldHistory[positionHeldHistory.length - 1].t / 1000, 2) + ' s captured'
          : 'No move captured';
        drawPositionPlot(field('posLive' + axis), positionLiveHistory, axis, {
          live: true,
          unit: units[axis],
          empty: 'Live position response will appear here.'
        });
        drawPositionPlot(field('posHeld' + axis), positionHeldHistory, axis, {
          live: false,
          unit: units[axis],
          empty: 'Run a position move to hold this plot.'
        });
      }
    }

