nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
    async function refresh() {
      const response = await fetch('/data');
      if (!response.ok) return;
      const data = await response.json();
      latestData = data;

      if (!formLoaded) {
        field('forward').value = data.command.forwardRpm;
        field('strafe').value = data.command.strafeRpm;
        field('rotate').value = data.command.rotateRpm;
        field('strafeSign').value = String(data.command.strafeSign);
        field('rotateSign').value = String(data.command.rotateSign);
        field('odomForwardSign').value = String(data.command.odomForwardSign);
        field('odomStrafeSign').value = String(data.command.odomStrafeSign);
        field('odomYawSign').value = String(data.command.odomYawSign);
        field('positionKp').value = data.position.kp;
        field('yawKp').value = data.position.yawKp;
        field('positionMaxRpm').value = data.position.maxRpm;
        field('positionToleranceCm').value = data.position.toleranceCm;
        field('yawToleranceDeg').value = data.position.yawToleranceDeg;
        field('odomForwardScale').value = data.command.odomForwardScale;
        field('odomStrafeScale').value = data.command.odomStrafeScale;
        for (let i = 0; i < 4; i++) {
          field('kp' + i).value = data.kp[i];
          field('ki' + i).value = data.ki[i];
        }
        field('duration').value = fmt(Number(data.timed.durationMs) / 1000, 2);
        formLoaded = true;
      }

      field('runState').textContent = data.enabled ? 'RUNNING' : 'STOPPED';
      field('timedState').textContent = data.timed.active
        ? 'CAPTURING ' + fmt(data.timed.elapsedMs / 1000, 2) + ' / ' + fmt(data.timed.durationMs / 1000, 2) + ' s'
        : (data.timed.id > 0 ? 'HELD TEST #' + data.timed.id : 'IDLE');
      field('dt').textContent = fmt(data.loopDtMs, 2);
      field('limit').textContent = fmt(data.rpmLimit, 1);
      field('scale').textContent = fmt(data.command.targetScale, 3);
      field('cpr').textContent = fmt(data.countsPerRev, 1);
      field('alpha').textContent = fmt(data.rpmFilterAlpha, 2);
      field('odomForward').textContent = fmt(data.odometry.forwardCm, 2);
      field('odomStrafe').textContent = fmt(data.odometry.strafeCm, 2);
      field('odomYaw').textContent = fmt(data.odometry.yawDeg, 2);
      field('positionMode').textContent = data.positionModeActive ? 'MOVING' : (data.positionTargetReached ? 'REACHED' : 'IDLE');
      field('targetForward').textContent = fmt(data.position.targetForwardCm, 2);
      field('targetStrafe').textContent = fmt(data.position.targetStrafeCm, 2);
      field('targetYaw').textContent = fmt(data.position.targetYawDeg, 2);
      field('errorForward').textContent = fmt(data.position.errorForwardCm, 2);
      field('errorStrafe').textContent = fmt(data.position.errorStrafeCm, 2);
      field('errorYaw').textContent = fmt(data.position.errorYawDeg, 2);
      field('headingSource').textContent = data.imu.headingUsesImu
        ? 'IMU FILTERED'
        : (data.imu.ok ? 'IMU CHECK CAL' : 'ENCODER');
      field('imuYaw').textContent = fmt(data.imu.yawDeg, 2);
      field('imuYawRaw').textContent = fmt(data.imu.yawRawDeg, 2);
      field('imuGyro').textContent = fmt(data.imu.gyroDps, 2);
      field('imuGyroFilt').textContent = fmt(data.imu.gyroFiltDps, 2);
      field('imuBias').textContent = fmt(data.imu.biasDps, 3);
      field('imuCalStd').textContent = fmt(data.imu.calStdDps, 3);

      for (let i = 0; i < 4; i++) {
        field('tar' + i).textContent = fmt(data.appliedTargetRpm[i], 2);
        field('raw' + i).textContent = fmt(data.rawRpm[i], 2);
        field('rpm' + i).textContent = fmt(data.rpm[i], 2);
        field('err' + i).textContent = fmt(data.errorRpm[i], 2);
        field('p' + i).textContent = fmt(data.pTerm[i], 1);
        field('i' + i).textContent = fmt(data.iTerm[i], 1);
        field('u' + i).textContent = fmt(data.rawOutput[i], 1);
        field('pwm' + i).textContent = data.pwm[i];
        field('hpwm' + i).textContent = data.hardwarePwm[i];
        field('int' + i).textContent = fmt(data.integralError[i], 2);
        field('cnt' + i).textContent = data.signedEncoderCounts[i];
        field('rawCnt' + i).textContent = data.rawEncoderCounts[i];
        field('sgn' + i).textContent = data.encoderSign[i] > 0 ? '+1' : '-1';
        field('msgn' + i).textContent = data.motorSign[i] > 0 ? '+1' : '-1';
      }

      appendLiveSample(data);
      captureTimedSample(data);
      capturePositionSample(data);
      drawPlots();
    }

    window.addEventListener('resize', drawPlots);
    setInterval(refresh, 100);
    refresh();
  </script>
</body>
</html>
)HTML";

void handleRoot() {
  server.send_P(200, "text/html", INDEX_HTML);
}

void handleData() {
  server.send(200, "application/json", telemetryJson());
}

bool applyConfigArgs() {
  bool gainsChanged = false;

  if (server.hasArg("forward")) {
    commandForwardRpm = constrain(server.arg("forward").toFloat(), -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  }

  if (server.hasArg("strafe")) {
    commandStrafeRpm = constrain(server.arg("strafe").toFloat(), -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  }

  if (server.hasArg("rotate")) {
    commandRotateRpm = constrain(server.arg("rotate").toFloat(), -RPM_TARGET_LIMIT, RPM_TARGET_LIMIT);
  }

  if (server.hasArg("strafeSign")) {
    strafeSign = server.arg("strafeSign").toInt() >= 0 ? 1 : -1;
  }

  if (server.hasArg("rotateSign")) {
    rotateSign = server.arg("rotateSign").toInt() >= 0 ? 1 : -1;
  }

  if (server.hasArg("odomForwardSign")) {
    odomForwardSign = server.arg("odomForwardSign").toInt() >= 0 ? 1 : -1;
  }

  if (server.hasArg("odomStrafeSign")) {
    odomStrafeSign = server.arg("odomStrafeSign").toInt() >= 0 ? 1 : -1;
  }

  if (server.hasArg("odomYawSign")) {
    odomYawSign = server.arg("odomYawSign").toInt() >= 0 ? 1 : -1;
  }

  if (server.hasArg("odomForwardScale")) {
    float value = server.arg("odomForwardScale").toFloat();
    if (value < 0.5f || value > 1.5f) {
      return false;
    }
    odomForwardScale = value;
  }

