nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
  if (server.hasArg("odomStrafeScale")) {
    float value = server.arg("odomStrafeScale").toFloat();
    if (value < 0.5f || value > 1.5f) {
      return false;
    }
    odomStrafeScale = value;
  }

  if (server.hasArg("positionKp")) {
    float value = server.arg("positionKp").toFloat();
    if (value < 0.0f) {
      return false;
    }
    positionKp = value;
  }

  if (server.hasArg("yawKp")) {
    float value = server.arg("yawKp").toFloat();
    if (value < 0.0f) {
      return false;
    }
    yawKp = value;
  }

  if (server.hasArg("positionMaxRpm")) {
    float value = server.arg("positionMaxRpm").toFloat();
    if (value <= 0.0f || value > RPM_TARGET_LIMIT) {
      return false;
    }
    positionMaxRpm = value;
  }

  if (server.hasArg("positionToleranceCm")) {
    float value = server.arg("positionToleranceCm").toFloat();
    if (value < 0.1f || value > 10.0f) {
      return false;
    }
    positionToleranceCm = value;
  }

  if (server.hasArg("yawToleranceDeg")) {
    float value = server.arg("yawToleranceDeg").toFloat();
    if (value < 0.5f || value > 15.0f) {
      return false;
    }
    yawToleranceDeg = value;
  }

  for (uint8_t wheel = 0; wheel < 4; wheel++) {
    String kpName = "kp" + String(wheel);
    String kiName = "ki" + String(wheel);

    if (server.hasArg(kpName)) {
      float value = server.arg(kpName).toFloat();
      if (value < 0.0f) {
        return false;
      }
      gainsChanged = gainsChanged || fabsf(velocityKp[wheel] - value) > 0.0001f;
      velocityKp[wheel] = value;
    }

    if (server.hasArg(kiName)) {
      float value = server.arg(kiName).toFloat();
      if (value < 0.0f) {
        return false;
      }
      gainsChanged = gainsChanged || fabsf(velocityKi[wheel] - value) > 0.0001f;
      velocityKi[wheel] = value;
    }
  }

  if (gainsChanged) {
    resetAllPiStates();
  }
  updateMecanumTargets();
  return true;
}

void handleConfig() {
  STATE_LOCK();
  bool ok = applyConfigArgs();
  STATE_UNLOCK();
  server.send(ok ? 200 : 400, "text/plain", ok ? "Config applied" : "Invalid config");
}

void handleStart() {
  STATE_LOCK();
  bool ok = applyConfigArgs();
  if (ok) {
    positionModeActive = false;
    positionTargetReached = false;
    resetAllPiStates();
    resetAllBodyPiStates();
    resetRpmMeasurementsToCurrentCounts();
    timedRunActive = false;
    timedRunStartMs = 0;
    controllerEnabled = true;
  }
  STATE_UNLOCK();
  server.send(ok ? 200 : 400, "text/plain", ok ? "Four-wheel velocity PI started" : "Invalid config");
}

void handlePositionStart() {
  STATE_LOCK();
  bool ok = applyConfigArgs();

  if (ok && server.hasArg("targetForwardCm")) {
    targetForwardCm = server.arg("targetForwardCm").toFloat();
  }

  if (ok && server.hasArg("targetStrafeCm")) {
    targetStrafeCm = server.arg("targetStrafeCm").toFloat();
  }

  float requestedYawDeg = 0.0f;
  if (ok && server.hasArg("targetYawDeg")) {
    requestedYawDeg = server.arg("targetYawDeg").toFloat();
  }

  if (ok) {
    positionMoveId++;
    if (positionMoveId == 0) positionMoveId = 1;
    float startYawDeg = displayedOdomYawDeg();
    targetYawDeg = wrapAngleDeg(startYawDeg + requestedYawDeg);
    resetOdometryToCurrentCounts();
    resetRpmMeasurementsToCurrentCounts();
    resetAllPiStates();
    resetAllBodyPiStates();
    positionErrorForwardCm = targetForwardCm;
    positionErrorStrafeCm = targetStrafeCm;
    positionErrorYawDeg = shortestAngleErrorDeg(targetYawDeg, displayedOdomYawDeg());
    positionTargetReached = false;
    positionModeActive = true;
    timedRunActive = false;
    timedRunStartMs = 0;
    controllerEnabled = true;
    updatePositionController(NOMINAL_DT_S);
  }

  STATE_UNLOCK();
  server.send(ok ? 200 : 400, "text/plain", ok ? "Position move started" : "Invalid position config");
}

void handleTimedStart() {
  STATE_LOCK();
  bool ok = applyConfigArgs();
  uint32_t durationMs = timedRunDurationMs;

  if (ok && server.hasArg("ms")) {
    long value = server.arg("ms").toInt();
    if (value < (long)TIMED_RUN_MIN_MS || value > (long)TIMED_RUN_MAX_MS) {
      ok = false;
    } else {
      durationMs = (uint32_t)value;
    }
  }

  if (ok) {
    positionModeActive = false;
    positionTargetReached = false;
    timedRunDurationMs = durationMs;
    timedRunStartMs = millis();
    timedRunId++;
    if (timedRunId == 0) timedRunId = 1;
    timedRunActive = true;
    controllerEnabled = true;
    resetAllPiStates();
    resetAllBodyPiStates();
    resetRpmMeasurementsToCurrentCounts();
  }
  STATE_UNLOCK();
  server.send(ok ? 200 : 400, "text/plain", ok ? "Timed four-wheel velocity test started" : "Invalid timed test config");
}

void handleStop() {
  STATE_LOCK();
  controllerEnabled = false;
  positionModeActive = false;
  timedRunActive = false;
  timedRunStartMs = 0;
  resetAllPiStates();
  resetAllBodyPiStates();
  stopAllMotors();
  STATE_UNLOCK();
  server.send(200, "text/plain", "Four-wheel velocity PI stopped");
}

void handleResetIntegral() {
  STATE_LOCK();
  resetAllPiStates();
  resetAllBodyPiStates();
  STATE_UNLOCK();
  server.send(200, "text/plain", "PI integrals reset");
}

void handleResetEncoders() {
  STATE_LOCK();
  resetEncoderMeasurements();
  resetOdometryToCurrentCounts();
  resetAllPiStates();
  resetAllBodyPiStates();
  STATE_UNLOCK();
  server.send(200, "text/plain", "Encoders reset");
}

void handleResetOdometry() {
  STATE_LOCK();
  resetOdometryToCurrentCounts();
  positionErrorForwardCm = targetForwardCm;
  positionErrorStrafeCm = targetStrafeCm;
  positionErrorYawDeg = shortestAngleErrorDeg(targetYawDeg, displayedOdomYawDeg());
  resetAllBodyPiStates();
  STATE_UNLOCK();
  server.send(200, "text/plain", "Odometry reset");
}

void handleImuZero() {
  STATE_LOCK();
  controllerEnabled = false;
  positionModeActive = false;
  timedRunActive = false;
  timedRunStartMs = 0;
  resetAllPiStates();
  resetAllBodyPiStates();
  stopAllMotors();
  imuYawDeg = 0.0f;
  imuYawRawDeg = 0.0f;
  targetYawDeg = 0.0f;
  positionErrorYawDeg = 0.0f;
  STATE_UNLOCK();
  server.send(200, "text/plain", "IMU heading zeroed");
}

void handleImuCal() {
  STATE_LOCK();
  controllerEnabled = false;
  positionModeActive = false;
  timedRunActive = false;
  timedRunStartMs = 0;
  resetAllPiStates();
  resetAllBodyPiStates();
  stopAllMotors();
  bool ok = imuCalibrateBias(500);
  if (ok) {
    imuYawDeg = 0.0f;
    imuYawRawDeg = 0.0f;
    targetYawDeg = 0.0f;
    positionErrorYawDeg = 0.0f;
  }
  STATE_UNLOCK();
  server.send(ok ? 200 : 400, "text/plain", ok ? "IMU bias calibrated" : "IMU calibration failed: keep robot completely still");
}

