nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
void controlTask(void* arg) {
  (void)arg;
  TickType_t lastWake = xTaskGetTickCount();
  uint32_t lastUs = micros();

  for (;;) {
    uint32_t nowUs = micros();
    float dt = ((uint32_t)(nowUs - lastUs)) / 1000000.0f;
    lastUs = nowUs;
    if (dt < 0.001f || dt > 0.200f) {
      dt = NOMINAL_DT_S;
    }

    STATE_LOCK();
    runControlTick(dt);
    STATE_UNLOCK();

    vTaskDelayUntil(&lastWake, pdMS_TO_TICKS(CONTROL_INTERVAL_MS));
  }
}

void webTask(void* arg) {
  (void)arg;
  for (;;) {
    server.handleClient();
    vTaskDelay(1);
  }
}

void uartTask(void* arg) {
  (void)arg;
  char lineBuf[UART_LINE_MAX];
  size_t idx = 0;

  for (;;) {
    while (Serial.available() > 0) {
      char c = (char)Serial.read();
      if (c == '\r') {
        continue;
      }
      if (c == '\n') {
        lineBuf[idx] = '\0';
        handlePiCommandLine(String(lineBuf));
        idx = 0;
        continue;
      }
      if (idx + 1 < UART_LINE_MAX) {
        lineBuf[idx++] = c;
      } else {
        idx = 0;
      }
    }
    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

void piTelemetryTask(void* arg) {
  (void)arg;
  uint32_t lastTelemetryMs = 0;

  for (;;) {
    String telemetry;
    String done;

    STATE_LOCK();
    uint32_t now = millis();
    if (now - lastTelemetryMs >= PI_TELEMETRY_INTERVAL_MS) {
      telemetry = buildPiTelemetryJson();
      lastTelemetryMs = now;
    }

    if (piActiveSeq != 0 && piMoveActive && !positionModeActive && positionTargetReached) {
      latchPiMoveOdom();
      queuePiDone(piActiveSeq, 1);
      piActiveSeq = 0;
    }

    if (piPendingDone) {
      done = buildPiDoneJson(piPendingDoneSeq, piPendingDoneCode);
      piPendingDone = false;
    }
    STATE_UNLOCK();

    if (telemetry.length() > 0) {
      sendJsonLine(telemetry);
    }
    if (done.length() > 0) {
      sendJsonLine(done);
    }

    vTaskDelay(pdMS_TO_TICKS(20));
  }
}


String buildMicroRosTelemetryJson() {
  String s;
  s.reserve(420);
  float localForward = displayedOdomForwardCm();
  float localStrafe = displayedOdomStrafeCm();
  float localProgress = sqrtf(localForward * localForward + localStrafe * localStrafe);
  float localRemaining = sqrtf(positionErrorForwardCm * positionErrorForwardCm + positionErrorStrafeCm * positionErrorStrafeCm);

  s += "{\"type\":\"telemetry\"";
  s += ",\"mode\":\"" + String(piModeText()) + "\"";
  s += ",\"seq\":" + String(piActiveSeq);
  s += ",\"imu\":{\"ok\":" + String(imuHeadingReady() ? "true" : "false");
  s += ",\"yawDeg\":" + String(displayedOdomYawDeg(), 3);
  s += ",\"rawYawDeg\":" + String(displayedImuYawRawDeg(), 3);
  s += ",\"gyroDps\":" + String(displayedImuGyroDps(), 3);
  s += ",\"gyroFiltDps\":" + String(displayedImuGyroDpsFilt(), 3);
  s += "}";
  s += ",\"pose\":{\"forwardCm\":" + String(piPoseForwardCm(), 2);
  s += ",\"strafeCm\":" + String(piPoseStrafeCm(), 2);
  s += ",\"yawDeg\":" + String(displayedOdomYawDeg(), 2);
  s += ",\"progressCm\":" + String(localProgress, 2);
  s += ",\"remainingCm\":" + String(localRemaining, 2);
  s += ",\"localForwardCm\":" + String(localForward, 2);
  s += ",\"localStrafeCm\":" + String(localStrafe, 2);
  s += "}";
  s += ",\"move\":{\"phase\":" + String(positionModeActive ? 2 : 0);
  s += ",\"angleDeg\":" + String(piLastMoveAngleDeg, 2);
  s += ",\"distanceCm\":" + String(piLastMoveDistanceCm, 2);
  s += ",\"headingTargetDeg\":" + String(targetYawDeg, 2);
  s += ",\"headingErrorDeg\":" + String(positionErrorYawDeg, 2);
  s += ",\"done\":" + String(positionTargetReached ? "true" : "false");
  s += "}}";
  return s;
}

void moveGoalCallback(const void* msgIn) {
  const std_msgs__msg__String* msg = (const std_msgs__msg__String*)msgIn;
  if (msg == nullptr || msg->data.data == nullptr || msg->data.size == 0) {
    return;
  }

  size_t n = min((size_t)msg->data.size, (size_t)(UART_LINE_MAX - 1));
  memcpy(moveGoalBuffer, msg->data.data, n);
  moveGoalBuffer[n] = '\0';

  String line(moveGoalBuffer);
  line.trim();
  if (line.length() == 0) {
    return;
  }

  String cmd = firstToken(line);
  cmd.toUpperCase();
  uint32_t seq = getUIntArg(line, "seq", 0);

  if (cmd == "MOVE") {
    float angleDeg = getFloatArg(line, "angle", 0.0f);
    float distCm = getFloatArg(line, "dist", 0.0f);
    float headingDeg = getFloatArg(line, "heading", 0.0f);
    STATE_LOCK();
    startPiPositionMove(seq, angleDeg, distCm, headingDeg);
    STATE_UNLOCK();
    return;
  }

  if (cmd == "TURN") {
    float headingDeg = getFloatArg(line, "heading", 0.0f);
    STATE_LOCK();
    startPiPositionMove(seq, 0.0f, 0.0f, headingDeg);
    STATE_UNLOCK();
    return;
  }

  if (cmd == "TWIST") {
    float forwardRpm = getFloatArg(line, "forward", 0.0f);
    float strafeRpm = getFloatArg(line, "strafe", 0.0f);
    float turnRpm = getFloatArg(line, "turn", 0.0f);
    uint32_t timeoutMs = getUIntArg(line, "timeout", CMD_VEL_TIMEOUT_MS);
    STATE_LOCK();
    startPiTwist(forwardRpm, strafeRpm, turnRpm, timeoutMs);
    STATE_UNLOCK();
    return;
  }

  if (cmd == "STOP") {
    STATE_LOCK();
    stopPiMotion(2);
    STATE_UNLOCK();
    return;
  }

  if (cmd == "RESET_ODOM") {
    STATE_LOCK();
    resetOdometryToCurrentCounts();
    resetPiBridgeOdom();
    positionErrorForwardCm = targetForwardCm;
    positionErrorStrafeCm = targetStrafeCm;
    positionErrorYawDeg = shortestAngleErrorDeg(targetYawDeg, displayedOdomYawDeg());
    resetAllBodyPiStates();
    STATE_UNLOCK();
    return;
  }

  if (cmd == "RESET_ENC") {
    STATE_LOCK();
    resetEncoderMeasurements();
    resetOdometryToCurrentCounts();
    resetPiBridgeOdom();
    resetAllPiStates();
    resetAllBodyPiStates();
    STATE_UNLOCK();
    return;
  }

  if (cmd == "ZERO_IMU") {
    STATE_LOCK();
    stopPiMotion(2);
    imuYawDeg = 0.0f;
    imuYawRawDeg = 0.0f;
    targetYawDeg = 0.0f;
    positionErrorYawDeg = 0.0f;
    STATE_UNLOCK();
    return;
  }

  if (cmd == "CAL_IMU" || cmd == "INIT_IMU") {
    STATE_LOCK();
    stopPiMotion(2);
    if (imuOk && imuCalibrateBias(500)) {
      imuYawDeg = 0.0f;
      imuYawRawDeg = 0.0f;
      targetYawDeg = 0.0f;
      positionErrorYawDeg = 0.0f;
    }
    STATE_UNLOCK();
    return;
  }
}

void telemetryTimerCallback(rcl_timer_t* timer, int64_t lastCallTime) {
  (void)lastCallTime;
  if (timer == nullptr) {
    return;
  }

