nadamorgan69-rgb/battery-powered-mobile-robot-audix/source-repositories/ros2_ws/firmware/audix_esp32_microros/audix_esp32_microros.ino
  String telemetry;
  STATE_LOCK();
  telemetry = buildMicroRosTelemetryJson();
  if (piActiveSeq != 0 && piMoveActive && !positionModeActive && positionTargetReached) {
    latchPiMoveOdom();
    piActiveSeq = 0;
  }
  STATE_UNLOCK();

  telemetry.toCharArray(telemetryJsonBuffer, MICRO_ROS_TELEMETRY_BUFFER);
  telemetryJsonMsg.data.data = telemetryJsonBuffer;
  telemetryJsonMsg.data.size = strlen(telemetryJsonBuffer);
  telemetryJsonMsg.data.capacity = MICRO_ROS_TELEMETRY_BUFFER;

  RCSOFTCHECK(rcl_publish(&telemetryJsonPub, &telemetryJsonMsg, nullptr));
}

bool initMicroRosEntities() {
  if (rmw_uros_ping_agent(MICRO_ROS_AGENT_PING_TIMEOUT_MS, MICRO_ROS_AGENT_PING_ATTEMPTS) != RMW_RET_OK) {
    return false;
  }

  microrosAllocator = rcl_get_default_allocator();

  if (rclc_support_init(&microrosSupport, 0, nullptr, &microrosAllocator) != RCL_RET_OK) {
    return false;
  }
  if (rclc_node_init_default(&microrosNode, "esp32_controller", "audix", &microrosSupport) != RCL_RET_OK) {
    return false;
  }

  std_msgs__msg__String__init(&moveGoalMsg);
  std_msgs__msg__String__init(&telemetryJsonMsg);

  moveGoalMsg.data.data = moveGoalBuffer;
  moveGoalMsg.data.size = 0;
  moveGoalMsg.data.capacity = UART_LINE_MAX;
  telemetryJsonMsg.data.data = telemetryJsonBuffer;
  telemetryJsonMsg.data.size = 0;
  telemetryJsonMsg.data.capacity = MICRO_ROS_TELEMETRY_BUFFER;

  if (rclc_subscription_init_best_effort(
          &moveGoalSub,
          &microrosNode,
          ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String),
          "esp/move_goal") != RCL_RET_OK) {
    return false;
  }
  if (rclc_publisher_init_best_effort(
          &telemetryJsonPub,
          &microrosNode,
          ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String),
          "esp/telemetry_json") != RCL_RET_OK) {
    return false;
  }
  if (rclc_timer_init_default(
          &telemetryTimer,
          &microrosSupport,
          RCL_MS_TO_NS(PI_TELEMETRY_INTERVAL_MS),
          telemetryTimerCallback) != RCL_RET_OK) {
    return false;
  }

  if (rclc_executor_init(&microrosExecutor, &microrosSupport.context, 2, &microrosAllocator) != RCL_RET_OK) {
    return false;
  }
  if (rclc_executor_add_subscription(&microrosExecutor, &moveGoalSub, &moveGoalMsg, &moveGoalCallback, ON_NEW_DATA) != RCL_RET_OK) {
    return false;
  }
  if (rclc_executor_add_timer(&microrosExecutor, &telemetryTimer) != RCL_RET_OK) {
    return false;
  }

  return true;
}

void destroyMicroRosEntities() {
  if (!microrosEntitiesCreated) {
    return;
  }

  rmw_context_t* rmwContext = rcl_context_get_rmw_context(&microrosSupport.context);
  if (rmwContext != nullptr) {
    (void)rmw_uros_set_context_entity_destroy_session_timeout(rmwContext, 0);
  }

  (void)rcl_timer_fini(&telemetryTimer);
  (void)rcl_subscription_fini(&moveGoalSub, &microrosNode);
  (void)rcl_publisher_fini(&telemetryJsonPub, &microrosNode);
  (void)rclc_executor_fini(&microrosExecutor);
  (void)rcl_node_fini(&microrosNode);
  (void)rclc_support_fini(&microrosSupport);

  microrosNode = rcl_get_zero_initialized_node();
  telemetryJsonPub = rcl_get_zero_initialized_publisher();
  moveGoalSub = rcl_get_zero_initialized_subscription();
  telemetryTimer = rcl_get_zero_initialized_timer();
  microrosExecutor = rclc_executor_get_zero_initialized_executor();
  microrosEntitiesCreated = false;
}

void microRosTask(void* arg) {
  (void)arg;
  set_microros_transports();
  delay(2000);

  for (;;) {
    if (!microrosEntitiesCreated) {
      uint32_t nowMs = millis();
      if ((uint32_t)(nowMs - microrosLastConnectAttemptMs) >= MICRO_ROS_RECONNECT_PERIOD_MS) {
        microrosLastConnectAttemptMs = nowMs;
        microrosEntitiesCreated = initMicroRosEntities();
      }
      vTaskDelay(pdMS_TO_TICKS(MICRO_ROS_SPIN_MS));
      continue;
    }

    if (rmw_uros_ping_agent(MICRO_ROS_AGENT_PING_TIMEOUT_MS, MICRO_ROS_AGENT_PING_ATTEMPTS) != RMW_RET_OK) {
      destroyMicroRosEntities();
      vTaskDelay(pdMS_TO_TICKS(MICRO_ROS_RECONNECT_PERIOD_MS));
      continue;
    }

    rcl_ret_t spinResult = rclc_executor_spin_some(&microrosExecutor, RCL_MS_TO_NS(MICRO_ROS_SPIN_MS));
    if (spinResult != RCL_RET_OK && spinResult != RCL_RET_TIMEOUT) {
      destroyMicroRosEntities();
    }
    vTaskDelay(pdMS_TO_TICKS(MICRO_ROS_SPIN_MS));
  }
}

void setup() {
  Serial.begin(UART_BAUD);
  delay(250);

  for (uint8_t i = 0; i < 4; i++) {
    setupEncoderPin(encoders[i].a);
    setupEncoderPin(encoders[i].b);
    encoderPrevState[i] = (digitalRead(encoders[i].a) << 1) | digitalRead(encoders[i].b);
  }

  attachInterrupt(digitalPinToInterrupt(encoders[0].a), isrEnc0A, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoders[0].b), isrEnc0B, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoders[1].a), isrEnc1A, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoders[1].b), isrEnc1B, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoders[2].a), isrEnc2A, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoders[2].b), isrEnc2B, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoders[3].a), isrEnc3A, CHANGE);
  attachInterrupt(digitalPinToInterrupt(encoders[3].b), isrEnc3B, CHANGE);

  for (uint8_t i = 0; i < 4; i++) {
    pwmAttachPinCompat(motors[i].in1, motors[i].ch1);
    pwmAttachPinCompat(motors[i].in2, motors[i].ch2);
  }

  stopAllMotors();
  imuInit();
  resetEncoderMeasurements();
  resetOdometryToCurrentCounts();
  resetAllPiStates();
  resetAllBodyPiStates();
  updateMecanumTargets();

  stateMutex = xSemaphoreCreateMutex();
  serialMutex = xSemaphoreCreateMutex();
  if (!stateMutex || !serialMutex) {
    Serial.println("ERROR: mutex creation failed.");
    return;
  }

  WiFi.mode(WIFI_AP);
  bool apOk = WiFi.softAP(AP_SSID, AP_PASS);

  server.on("/", HTTP_GET, handleRoot);
  server.on("/data", HTTP_GET, handleData);
  server.on("/cmd/config", HTTP_GET, handleConfig);
  server.on("/cmd/start", HTTP_GET, handleStart);
  server.on("/cmd/positionStart", HTTP_GET, handlePositionStart);
  server.on("/cmd/timedStart", HTTP_GET, handleTimedStart);
  server.on("/cmd/stop", HTTP_GET, handleStop);
  server.on("/cmd/resetI", HTTP_GET, handleResetIntegral);
  server.on("/cmd/resetEnc", HTTP_GET, handleResetEncoders);
  server.on("/cmd/resetOdom", HTTP_GET, handleResetOdometry);
  server.on("/cmd/imuZero", HTTP_GET, handleImuZero);
  server.on("/cmd/imuCal", HTTP_GET, handleImuCal);
  server.begin();

  (void)apOk;

  xTaskCreatePinnedToCore(controlTask, "mecanum-position-pi", 6144, nullptr, 4, &controlTaskHandle, 1);
  xTaskCreatePinnedToCore(microRosTask, "micro-ros", 20000, nullptr, 5, &microRosTaskHandle, 0);
  xTaskCreatePinnedToCore(webTask, "mecanum-web", 8192, nullptr, 2, &webTaskHandle, 0);
}

void loop() {
  vTaskDelay(pdMS_TO_TICKS(1000));
}
